<div id="odigiesEnimerotiko" class="enimerosi">

<div class="enimerosiTitlos">
<div class="enimerosiTitlosKimeno">ΣΗΜΑΝΤΙΚΟ</div>
</div>

<div>
Φίλοι πρεφαδόροι, μετά το τέλος κάθε παρτίδας <span class="enimerosiEntono">
μην αμελείτε την έξοδό σας από το τραπέζι</span>.
Πράγματι, κάθε ενεργό τραπέζι, όπως εξάλλου και κάθε ενεργός παίκτης, καταναλώνουν
πόρους του server, επομένως όσο λιγότερα τα ενεργά τραπέζια και οι ενεργοί παίκτες
τόσο καλύτερη η συμπεριφορά του προγράμματος για τις παρτίδες που βρίσκονται σε εξέλιξη.
Επίσης, μην παραμένετε άσκοπα στο χώρο του καφενείου για μεγάλα χρονικά διαστήματα, αλλά
<span class="enimerosiEntono">βγαίνετε από το πρόγραμμα</span>, καθώς με την παραμονή σας
στον «Πρεφαδόρο» καταναλώνετε πόρους του server που θα ήταν προτιμότερο να διατεθούν στους
ενεργούς παίκτες.
</div>

<hr>

<div>
Οι οδηγίες έχουν αντιγραφεί από τον παλαιό «Πρεφαδόρο» και τελούν υπό διαμόρφωση,
με αποτέλεσμα να λείπουν κάποιες εικόνες και ορισμένοι σύνδεσμοι να μην οδηγούν πουθενά.
Το περιεχόμενο, επίσης, σε πολλά σημεία δεν είναι ενημερωμένο,
επομένως θα πρέπει να είστε επιφυλακτικοί.
</div>

</div>
