<?php ////////////////////////////////////////////////////////////////////////////////////////////////////////////// ?>

<?php self::titlos('Εισαγωγή'); ?>

<p class="odigiesKimeno">
Το διαδικτυακό καφενείο της πρέφας είναι ένας ιστότοπος που σας δίνει τη δυνατότητα
να παίξετε πρέφα με τους φίλους σας οποιαδήποτε ώρα και χωρίς να βρίσκεστε απαραίτητα
στον ίδιο χώρο. Για να παίξετε πρέφα στο διαδικτυακό καφενείο θα πρέπει προηγουμένως
να εγγραφείτε, δηλαδή θα πρέπει να
<a target="egrafi" href="<?php Globals::url('account'); ?>">δημιουργήσετε λογαριασμό</a>.
Έχοντας δημιουργήσει
λογαριασμό, μπορείτε να εισέρχεστε με το όνομά σας στο καφενείο και να στήνετε τραπέζια
στα οποία να προσκαλείτε τους φίλους σας για να παίξετε μια παρτίδα πρέφα. Μπορείτε,
ακόμη, να συμμετέχετε στα τραπέζια των φίλων σας, εφόσον αυτοί σας έχουν προσκαλέσει.
Τέλος, μπορείτε να παρακολουθήσετε παρτίδες που βρίσκονται σε εξέλιξη, εφόσον, φυσικά
έχετε πρόσβαση στα τραπέζια στα οποία εξελίσσονται οι παρτίδες αυτές. Το πρόγραμμα
παρέχει και τη δυνατότητα γραπτής επικοινωνίας των συμπαικτών, είτε με απευθείας
ανταλλαγή μηνυμάτων (chat), είτε με αποστολή προσωπικών μηνυμάτων (mail), επομένως
μπορεί να χρησιμοποιηθεί και ως χώρος συζήτησης και απλής κοινωνικής δικτύωσης γενικότερα.
</p>

<p class="odigiesKimeno">
Το παρόν εγχειρίδιο είναι οργανωμένο σε ενότητες, ενώ στην αρχή του κειμένου υπάρχουν
περιεχόμενα από τα οποία μπορείτε να μεταβείτε στις επιμέρους ενότητες του κειμένου.
Μπορείτε να μετακινηθείτε σε οποιαδήποτε ενότητα του παρόντος εγχειριδίου κάνοντας κλικ
στην αντίστοιχη εγγραφή των περιεχομένων, ενώ, αντίστροφα, μπορείτε να επανέρχεστε στην
αρχή του κειμένου κάνοντας κλικ στον τίτλο οποιασδήποτε ενότητας του κειμένου.
</p>

<?php ////////////////////////////////////////////////////////////////////////////////////////////////////////////// ?>

<?php self::titlos('Θέλω να παίξω!'); ?>

<p class="odigiesKimeno">
Αν βιάζεστε να παίξετε και πιστεύετε ότι θα τα καταφέρετε χωρίς να διαβάσετε τις αναλυτικές
οδηγίες, βρείτε δύο φίλους και εγγραφείτε στο διαδικτυακό καφενείο της πρέφας. Κατόπιν ανοίξτε
ένα νέο τραπέζι κάνοντας κλικ στο σχετικό εικονίδιο
<span class="nobr">(<img src="../ikona/panel/miaPrefa.png" class="odigiesIconInline" />),</span>
και προσκαλέστε τους φίλους σας
εντοπίζοντάς τους στην περιοχή των σχετιζομένων προσώπων και κάνοντας κλικ στο όνομά τους.
Εφόσον οι φίλοι σας αποδεχθούν την πρόσκλησή σας, θα βρεθείτε όλοι μαζί στο τραπέζι που έχετε
δημιουργήσει. Κατόπιν κάνετε κλικ στο πράσινο check αποδοχής όρων του παιχνιδιού
<span class="nobr">(<img src="../ikona/panel/apodoxi.png" class="odigiesIconInline" />),</span>
ή στο εικονίδιο εκκίνησης <span class="nobr">(<img src="../ikona/panel/go.jpg"
class="odigiesIconInline" />)</span> και θα ξεκινήσει αμέσως μια νέα παρτίδα.
</p>

<p class="odigiesKimeno">
Μπορείτε να παίξετε μέχρι να μηδενίσετε κάσα, ή να συνεχίσετε ακόμη και με αρνητικό υπόλοιπο κάσας
(είναι σαν να έχετε προσθέσει νέα καπίκια στην κάσα). Όποτε θέλετε μπορείτε να αποχωρήσετε από το τραπέζι
<span class="nobr">(<img src="../ikona/panel/exodos.png" class="odigiesIconInline" />),</span>
να ανοίξετε νέο τραπέζι, να εκκινήσετε νέα παρτίδα, να παρακολουθήσετε κάποια άλλη παρτίδα κλπ.
Οι περισσότερες λειτουργίες γίνοντα με κλικ σε κάποιο εικονίδιο/εργαλείο από αυτά που
παρέχονται σε διάφορα σημεία της σελίδας, αλλά κυρίως στο <span class="entono">control panel</span>,
δηλαδή στην κεντρική στήλη εργαλείων στην κορυφή της οποίας υπάρχει το εικονίδιο εναλλαγής
<span class="nobr">εργαλείων (<img src="../ikona/panel/4Balls.png" class="odigiesIconInline" />),</span>
με το οποίο εμφανίζονται διαδοχικά όλα τα διαθέσιμα εργαλεία που παρέχονται σε κάθε φάση του παιχνιδιού.
Καλή διασκέδαση!
</p>

<?php ////////////////////////////////////////////////////////////////////////////////////////////////////////////// ?>

<?php self::titlos('Εγγραφή'); ?>

<p class="odigiesKimeno">
Στο επάνω δεξιά μέρος της οθόνης του φυλλομετρητή σας υπάρχει πεδίο δημιουργίας λογαριασμού
[<a target="egrafi" href="<?php Globals::url('account'); ?>">Εγγραφή</a>].
Κάνοντας κλικ στο συγκεκριμένο πεδίο μπορείτε να δημιουργήσετε λογαριασμό για το διαδικτυακό
καφενείο της πρέφας.
Για να δημιουργήσετε λογαριασμό είναι απαραίτητο να δώσετε κάποιο όνομα με το οποίο θα εισέρχεστε
αργότερα στο καφενείο (login), το πλήρες όνομά σας και ένα email (προαιρετικό).
Φυσικά, θα πρέπει να δώσετε και κάποιον κωδικό (password) ώστε να μην μπορεί οποιοσδήποτε να εισέρχεται
στο καφενείο με το δικό σας όνομα.
</p>

<p class="odigiesKimeno">
Το login σας δεν μπορεί να περιέχει ελληνικούς χαρακτήρες·
μπορείτε να χρησιμοποιήσετε μόνο λατινικούς χαρακτήρες, αριθμητικά ψηφία και κάποια σημεία στίξης.
Καλό είναι το login σας να είναι μικρό, ευανάγνωστο και να έχει κάποια σχέση με το όνομά σας.
Αμέσως μετά την εγγραφή σας θα μεταφερθείτε αυτόματα στο χώρο του διαδικτυακού καφενείου και μπορείτε να
στήσετε το πρώτο σας τραπέζι, να αναζητήσετε φίλους και να απευθύνετε ή να δεχθείτε προσκλήσεις για
παιχνίδι.
Εφόσον στήσετε κάποιο τραπέζι, ή ενταχθείτε σε κάποιο τραπέζι, μπορείτε να ανταλλάσσετε γραπτά
μηνύματα με τους συμπαίκτες σας και, φυσικά, να παίξετε μια ή περισσότερες παρτίδες πρέφα.
</p>

<?php self::titlos('Είσοδος'); ?>

<p class="odigiesKimeno">
Για να εισέλθετε στο διαδικτυακό καφενείο μπορείτε να κάνετε κλικ στην επιλογή
[<a href="#Είσοδος">Είσοδος</a>]
στο επάνω δεξιά μέρος της οθόνης του φυλλομετρητή σας.
Στη φόρμα που θα εμφανιστεί δίνετε το login σας και τον κωδικό σας και πατάτε το πλήκτρο [Login].
Εφόσον έχετε εισαγάγει σωστά τα στοιχεία σας, θα εισέλθετε στο διαδικτυακό καφενείο και θα έχετε
την επιλογή να στήσετε ένα νέο τραπέζι προσκαλώντας τους φίλους σας στο παιχνίδι, ή να συμμετέχετε
σε κάποιο τραπέζι στο οποίο είστε προσκεκλημένος.
Μπορείτε, ακόμη, να παρακολουθήσετε παρτίδες που εξελίσσονται στο καφενείο, ή να συζητήσετε
με άλλους παίκτες που περιφέρονται στο διαδικτυακό καφενείο.
</p>

<p class="odigiesKimeno">
Εφόσον έχετε πραγματοποιήσει είσοδο στο διαδικτυακό καφενείο της πρέφας, το πρόγραμμα σας κρατά
συνδεδεμένους για αρκετά μεγάλο χρονικό διάστημα, ακόμη και αν κινείστε σε σελίδες που δεν αφορούν στο
παιχνίδι (Βοήθεια, Administrator κλπ).
Η περίοδος παραμονής σας στο χώρο του καφενείου ονομάζεται συνεδρία και για να διακόψετε μια συνεδρία,
θα πρέπει να πραγματοποιήσετε ρητή <a href="#Έξοδος">έξοδο</a> από το χώρου του διαδικτυακού καφενείου.
</p>


<?php self::titlos('Έξοδος'); ?>

<p class="odigiesKimeno">
Μπορείτε να εξέλθετε από το χώρο του διαδικτυακού καφενείου, όποια στιγμή το θελήσετε, κάνοντας
κλικ στην προτροπή [<a href="#Έξοδος">Έξοδος</a>] που βρίσκεται στο επάνω δεξιά μέρος της οθόνης
του φυλλομετρητή σας.
Αν συμμετέχετε σε κάποιο τραπέζι και εξέλθετε από το διαδικτυακό καφενείο, θα συνεχίσετε να
συμμετέχετε στο τραπέζι και οι συμπαίκτες σας θα αντιληφθούν την απουσία σας από το περίγραμμα
της θέσης σας το οποίο θα γίνει διακεκομμένο.
Το παιχνίδι δεν θα μπορέσει, φυσικά, να συνεχιστεί παρά μόνο μετά την επανείσοδό σας στο καφενείο.
Βεβαίως, αν αποχωρείτε από το διαδικτυακό καφενείο χωρίς προηγουμένως να ενημερώνετε τους συμπαίκτες σας
μέσω γραπτών μηνυμάτων, είναι πολύ πιθανόν αυτοί να αποχωρήσουν από το τραπέζι και να μην βρείτε
κανέναν εκεί όταν και αν αποφασίσετε να ξαναμπείτε στο διαδικτυακό καφενείο.
</p>

<p class="odigiesKimeno">
Αν συμμετέχετε σε κάποιο τραπέζι και θέλετε να διακόψετε την παρτίδα, ή θέλετε να αποχωρήσετε
από το διαδικτυακό καφενείο, το σωστό είναι να αποχωρήσετε πρώτα από το τραπέζι.
Σ' αυτήν την περίπτωση οι συμπαίκτες σας θα έχουν τη δυνατότητα να προσκαλέσουν κάποιον άλλο
παίκτη να παίξει στη θέση σας.
Αν θέλετε, βέβαια, και εφόσον η θέση σας παραμένει κενή, μπορείτε αργότερα να επανέλθετε στο τραπέζι
και ο μόνος τρόπος για να επανέλθετε ως παίκτης σε κάποιο ήδη στημένο τραπέζι είναι να έχετε
πρόσκληση για το τραπέζι αυτό.
Πάντως, για να μη βρεθείτε στη δυσάρεστη θέση της αθέλητης διακοπής μιας καλής παρτίδας,
το πρόγραμμα σας απευθύνει πρόσκληση για παιχνίδι κάθε φορά που στήνετε κάποιο νέο τραπέζι.
Πρόκειται για προσκλήσεις που γίνονται αυτόματα από εσάς προς τον εαυτό σας.
Αν σας ενοχλούν αυτές ή άλλες προσκλήσεις μπορείτε ανά πάσα στιγμή να τις απορρίψετε
κάνοντας κλικ στα σχετικά εικονίδια
(<img src="../ikona/misc/Xred.png" class="odigiesIconInline" />,
<img src="../ikona/misc/Xgreen.png" class="odigiesIconInline" />,
βλ. "<a href="#Προσκλήσεις">Προσκλήσεις</a>").
</p>

<?php self::titlos('Περιγραφή του χώρου'); ?>

<p class="odigiesKimeno">
Εφόσον έχετε εισέλθει επιτυχώς στο διαδικτυακό καφενείο θα πρέπει να βλέπετε στην οθόνη σας
τις εξής ενότητες:
Αριστερά υπάρχει το καφενείο, ή η τσόχα πάνω στην οποία εξελίσσεται ή πρόκειται να εξελιχθεί
το παιχνίδι της πρέφας, στο κέντρο υπάρχει μια στενή στήλη με εργαλεία
(<a href="#Control_panel">control panel</a>)
που φέρει στην κορυφή της ένα εικονίδιο με τέσσερις πολύχρωμες μπάλες
<span class="nobr">(<img src="../ikona/panel/4Balls.png" class="odigiesIconInline" />),</span>
ενώ δεξιότερα υπάρχουν τρεις ενότητες που αφορούν στις <a href="#Προσκλήσεις">προσκλήσεις</a>,
στην <a href="#Φίλοι_και_ανεπιθύμητοι">αναζήτηση παικτών</a>
και στην <a href="#Ανταλλαγή_μηνυμάτων">ανταλλαγή γραπτών μηνυμάτων</a>
αντίστοιχα.
</p>

<p class="odigiesKimeno">
Στο σημείο αυτό να πούμε ότι η τσόχα των τραπεζιών έχει πράσινο
<span class="nobr">χρώμα (<img src="../ikona/trapezi/kafenioPeximo.jpg"
	class="odigiesIconInline" style="width: 0.45cm; height: 0.45cm;" />),</span>
εκτός και αν είστε θεατής σε κάποιο τραπέζι, οπότε το χρώμα της τσόχας φαίνεται
<span class="nobr">μπεζ (<img src="../ikona/trapezi/kafenioTheasi.jpg"
	class="odigiesIconInline" style="width: 0.45cm; height: 0.45cm;" />)</span>.
Επίσης να πούμε ότι ενώ μπορείτε να συμμετέχετε σε πολλά τραπέζια ως παίκτης, μπορείτε να είστε
θεατής σε ένα μόνο τραπέζι κάθε φορά.
Το τραπέζι το οποίο βλέπετε κάθε φορά είναι είτε το νεότερο από τα τραπέζια στα οποία συμμετέχετε
ως παίκης, ενώ αν είστε θεατής σε κάποιο τραπέζι, τότε αυτό το τραπέζι έχει προτεραιότητα.
</p>

<p class="odigiesKimeno">
Κάνοντας κλικ στο tab [<?php self::sindesmos("Καφενείο"); ?>] της γραμμής εργαλείων που βρίσκεται
στο επάνω μέρος της οθόνης, στη θέση της τσόχας θα εμφανιστούν οι περιφερόμενοι online παίκτες
και αμέσως μετά όλα τα ενεργά τραπέζια με τους θεατές τους. Περιφερόμενοι θεωρούνται οι παίκτες
που δεν ανήκουν σε κάποιο τραπέζι είτε ως παίκτες είτε ως θεατές, βρίσκονται ωστόσο σε κατάσταση online.
Εδώ μπορείτε να συμμετάσχετε σε δημόσια συζήτηση με όλους τους υπόλοιπους παίκτες που βρίσκονται
στο χώρου του καφενείου.
Μπορείτε ακόμη να στείλετε προσωπικά μηνύματα ή να προσκαλέσετε παίκτες στο τραπέζι σας,
απλώς κάνοντας κλικ στο όνομά τους.
</p>

<p class="odigiesKimeno">
Αν κάνετε κλικ σε οποιονδήποτε παίκτη όπου αυτός εμφανίζεται στο χώρο του διαδικτυακού καφενείου,
τότε ανοίγει νέα καρτέλα στο φυλλομετρητή σας όπου μπορείτε να στείλετε κάποιο προσωπικό μήνυμα,
ή να απευθύνετε πρόσκληση, εφόσον συμμετέχετε ως παίκτης σε κάποιο τραπέζι.
Αν ο παίκτης που καλείτε δηλώνει απασχολημένος, απορρίπτει την πρόσκλησή σας, ή αργεί να ανταποκριθεί
στα αιτήματά σας, μη συνεχίζετε τις οχλήσεις αμέσως αλλά δοκιμάστε πάλι σε εύλογο χρονικό διάστημα.
Για να δείτε και πάλι το τραπέζι στο οποίο συμμετέχετε κάνετε κλικ στο tab
[<?php self::sindesmos("Τραπέζι"); ?>] στη γραμμή εργαλείων.
</p>

<?php self::titlos('Control panel'); ?>

<p class="odigiesKimeno">
Πρόκειται για πίνακα ελέγχου στον οποίο εμφανίζονται εικονίδια εργαλείων με τα οποία μπορείτε
να ελέγξετε αρκετές επιλογές του παιχνιδιού, π.χ.  το μέγεθος της κάσας, τη διάταξη των παικτών κλπ.
Τα εργαλεία του control panel αλλάζουν κάνοντας κλικ στο εικονίδιο με τις τέσσερις πολύχρωμες μπάλες
<span class="nobr">(<img src="../ikona/panel/4Balls.png" class="odigiesIconInline" />),</span>
πάντως το πρόγραμμα προτείνει τα πιο συχνά χρησιμοποιούμενα εργαλεία ανάλογα με τη φάση του παιχνιδιού.
Γενικά, στο control panel εμφανίζονται τα παρακάτω εικονίδια:
</p>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/misc/mazemaPano.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Το control panel αποτελείται από αρκετές σειρές εργαλείων που εναλλάσσονται κατά το δοκούν.
Κάνοντας κλικ στο εικονίδιο επανεμφάνισης βασικών εργαλείων επιστρέφουμε στην ομάδα βασικών
εργαλείων της εκάστοτε φάσης του παιχνιδιού.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
	<img src="../ikona/panel/idioktito.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ στο εικονίδιο ρυθμίσεων του τραπεζιού αλλάζουμε το ιδιοκτησιακό καθεστώς του τραπεζιού
σε ιδιόκτητο.
Αυτό σημαίνει ότι μόνο ο δημιουργός του τραπεζιού μπορεί να κάνει ρυθμίσεις (κάσα, διάταξη, ιδιωτικότητα,
άσοι, πάσο πάσο πάσο κλπ).
Δημιουργός θεωρείται ο παίκτης που κάθεται στην πρώτη θέση του τραπεζιού.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/elefthero.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ στο συγκεκριμένο εικονίδιο επαναφέρουμε το ιδιοκτησιακό καθεστώς του τραπεζιού σε ελεύθερο.
Αυτό σημαίνει ότι όλοι οι παίκτες μπορούν να κάνουν ρυθμίσεις (κάσα, διάταξη, ιδιωτικότητα, άσοι,
πάσο πάσο πάσο κλπ).
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/diataxi.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ στο συγκεκριμένο εικονίδιο αλλάζουμε τη διάταξη των παικτών.
Επειδή το πρόγραμμα μας εμφανίζει πάντοτε στο κάτω μέρος του τραπεζιού (νότος),
ουσιαστικά φαίνονται να εναλλάσσονται οι άλλοι δύο παίκτες (ανατολή, δύση).
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/roloi.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Παρόμοια λειτουργία επιτελεί και το εικονίδιο αλλαγής θέσης.
Κάνοντας κλικ στο συγκεκριμένο εικονίδιο ο παίκτης διατρέχει με τη σειρά όλες τις κενές θέσεις
του τραπεζιού.
Η λειτουργία των εργαλείων αλλαγής θέσης γίνεται καλύτερα εμφανής αν βρίσκεστε στο καφενείο,
παρά όταν βλέπετε την τσόχα του τραπεζιού.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/kasa.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ στο συγκεκριμένο εικονίδιο αλλάζουμε την αρχική κάσα του τραπεζιού από 500 σε 300 καπίκια
(για κάθε παίκτη) και τούμπαλιν.
Το μέγεθος της κάσας εμφανίζεται μαζί με άλλα στοιχεία του τραπεζιού στο επάνω μέρος της τσόχας.
<p>
</p>
Οι παίκτες, όμως, μπορούν να αυξήσουν, ή να μειώσουν την κάσα και κατά τη διάρκεια του παιχνιδιού
κάνοντας κλικ στα αντίστοιχα εικονίδια
<span class="nobr">(<img src="../ikona/panel/kasaPano.png" class="odigiesIconInline" />,
<img src="../ikona/panel/kasaKato.png" class="odigiesIconInline" />)</span>
που εμφανίζονται στην περιοχή πληροφοριών παρτίδας, στο επάνω μέρος του τραπεζιού.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/apodoxi.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Σημαίνει αποδοχή των όρων του παιχνιδιού.
Κάνοντας κλικ σε αυτό το εικονίδιο, το εικονίδιο αλλάζει χρώμα και γύρω από την περιοχή μας
εμφανίζεται πρασινωπό περίγραμμα ώστε να γνωρίζουν και οι υπόλοιποι παίκτες ότι αποδεχόμαστε
τους όρους του παιχνιδιού όπως έχουν αυτή τη χρονική στιγμή.
Το παιχνίδι ξεκινά τη στιγμή που και οι τρεις παίκτες έχουν αποδεχθεί τους όρους του παιχνιδιού,
γι' αυτό ο τρίτος παίκτης που θα αποδεχθεί τους όρους του παιχνιδιού θα δει το εικονίδιο
<span class="nobr"><img src="../ikona/panel/go.jpg" class="odigiesIconInline" />,</span>
αντί του πράσινου check.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/ixodopa.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Σημαίνει επαναδιαπραγμάτευση των όρων του παιχνιδιού.
Κάνοντας κλικ σε αυτό το εικονίδιο, το εικονίδιο γίνεται πάλι πράσινο, ενώ το πρασινωπό πλαίσιο
που περιέβαλλε την περιοχή μας γίνεται πάλι κοκκινωπό υποδηλώνοντας στους συμπαίκτες μας ότι
ακόμη δεν έχουμε αποδεχθεί τους όρους του παιχνιδιού.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/kitapi.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ σε αυτό το εικονίδιο εμφανίζεται το φύλλο αγώνα, δηλαδή το κιτάπι με τις δοσοληψίες
μεταξύ των παικτών.
Κατά τη διάρκεια του παιχνιδιού υπάρχει online ενημέρωση με τα καπίκια που κερδίζει ή χάνει κάθε παίκτης
ανά πάσα στιγμή, αλλά παρέχεται και η δυνατότητα εμφάνισης του παραδοσιακού τρόπου γραφής για λόγους
συναισθηματικούς. Ένα σημείο που χρειάζεται προσοχή είναι ότι το φύλλο αγώνα εμφανίζεται με την ίδια
διάταξη σε όλους τους συμπαίκτες, πράγμα που σημαίνει ότι στην κάτω θέση εμφανίζεται ο γράφων και όχι
ο παίκτης που τρέχει το πρόγραμμα, όπως συμβαίνει με το τραπέζι.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/kapikia.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ σ' αυτό το εικονίδιο, εμφανίζονται στην περιοχή των παικτών τα καπίκια που
κέρδισαν ή έχασαν οι παίκτες στην τελευταία διανομή.
Πράγματι, στην περιοχή του κάθε παίκτη αναγράφονται τα καπίκια που κερδίζουν ή χάνουν
οι παίκτες ανά πάσα στιγμή, δηλαδή τα κέρδη ή οι ζημίες μετά το μοίρασμα του τρέχοντος
υπολοίπου της κάσας.
Παρ' όλα αυτά, πολλές φορές είναι χρήσιμο να βλέπουμε τα κάρδη και της ζημίες της
τελευταία διανομής.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/kafedaki.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Το συγκεκεριμένο εικονίδιο δεν βρίσκεται στο control panel, αλλά στο panel συζήτησης.
Κάνοντας κλικ σε αυτό το εικονίδιο μπορούμε να ελαχιστοποιήσουμε προσωρινά το χώρο του παιχνιδιού,
ή το χώρο του καφενείου και να αυξήσουμε έτσι τον διαθέσιμο χώρο στην περιοχή ανταλλαγής μηνυμάτων
(chat mode).
Αυτή η διαδικασία μπορεί να μας φανεί χρήσιμη όταν δεν παίζουμε κάποια παρτίδα, αλλά απλώς συνομιλούμε
με τους συμπαίκτες μας.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/endixi/dealer.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Το συγκεκεριμένο εικονίδιο δεν βρίσκεται στο control panel, αλλά στο panel συζήτησης.
Αυτό το εικονίδιο εμφανίζεται εφόσον είμαστε σε chat mode και μας επαναφέρει στο χώρο του παιχνιδιού
μειώνοντας αντίστοιχα το χώρο συζήτησης.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/apasxolimenos.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Το συγκεκεριμένο εικονίδιο δεν βρίσκεται στο control panel, αλλά στο panel προσκλήσεων.
Κάνοντας κλικ σε αυτό το εικονίδιο υποδηλώνουμε ότι δεν είμαστε διαθέσιμοι για παιχνίδι
και εμφανιζόμαστε στο χώρο του καφενείου με αχνότερα χρώματα ως απασχολημένοι.
Οι απασχολημένοι παίκτες δεν δέχονται προσκλήσεις παρά μόνον από παίκτες τους οποίους
έχουν χαρακτηρίσει ως φίλους.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/diathesimos.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ σε αυτό το εικονίδιο δηλώνουμε ότι είμαστε διαθέσιμοι για παιχνίδι αίροντας
προηγούμενη ενέργειά μας με την οποία είχαμε τεθεί σε κατάσταση μη αποδοχής προσκλήσεων
ως απασχολημένοι.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/postel/kanoniko.png" class="odigiesIcon" />
<img src="../ikona/panel/postel/anisoropo.png" class="odigiesIcon" />
<img src="../ikona/panel/postel/dikeo.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ σε αυτά τα εικονίδια αλλάζετε τον τρόπο πληρωμής της τελευταίας αγοράς.
Κανονικά η πληρωμή της τελευταίας αγοράς προσαρμόζεται στο υπόλοιπο της κάσας.
Αν το τραπέζι σας σημαίνεται με το
<span class="nobr">εικονίδιο <img src="../ikona/panel/postel/anisoropo.png" class="odigiesIconInline" />,</span>
τότε η αγορά θα πληρωθεί με βάση το υπόλοιπο της κάσας, αλλά σε περίπτωση που μπει μέσα είτε ο τζογαδόρος,
είτε οι αμυνόμενοι παίκτες, η πληρωμή θα γίνει με την πραγματική αξία της αγοράς.
<p></p>
Αν το τραπέζι σας σημαίνεται με το
<span class="nobr">εικονίδιο <img src="../ikona/panel/postel/dikeo.png" class="odigiesIconInline" />,</span>
τότε η αγορά θα πληρωθεί με βάση την πραγματική αξία της αγοράς, είτε βγει κανονικά, είτε μπει μέσα.
Σ' αυτή την περίπτωση θα ενισχυθεί η κάσα με αποτέλεσμα να παρουσιάζει αρνητικό υπόλοιπο, πράγμα που
δεν είναι καθόλου κακό, αλλά ξενίζει τους περισσότερους παίκτες.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/exodos.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Σημαίνει αποχώρηση από το τραπέζι.
Αν είμαστε θεατές στο τραπέζι, τότε μετά την αποχώρησή μας, θα εμφανιστούμε στο
νεότερο από τα τραπέζια στα οποία συμμετέχουμε ως παίκτες.
Αν δεν συμμετέχουμε σε κάποιο τραπέζι, τότε θα μας δοθεί η επιλογή της δημιουργίας νέου τραπεζιού
και μπορούμε είτε να δημιουργήσουμε κάποιο νέο τραπέζι, είτε να μεταβούμε ως θεατές σε κάποιο
άλλο τραπέζι, είτε να να παραμείνουμε περιφερόμενοι στο καφενείο.
<p></p>
Αν αποχωρήσουμε από τραπέζι στο οποίο συμμετέχουμε ως παίκτες και όχι ως θεατές, είναι πιθανό
οι συμπαίκτες μας να μην μπορούν να συνεχίσουν το παιχνίδι.
Για να μπορέσει να συνεχιστεί το παιχνίδι, θα πρέπει να προσκαλέσουν κάποιον άλλο παίκτη και μόνον
εφόσον αυτός αποδεχθεί την πρόσκληση, το παιχνίδι θα μπορέσει να συνεχιστεί.
Μπορούμε, ακόμη, να επανέλθουμε στο τραπέζι, εφόσον, φυσικά, υπάρχει σχετική πρόσκληση.
Αποχώρηση από το τραπέζι, χωρίς να έχει τελειώσει η παρτίδα, κάνουμε συνήθως όταν έχουμε απευθύνει
προσκλήσεις και οι προσκεκλημένοι μας δεν έχουν ανταποκριθεί, ή ακόμη και κατά τη διάρκεια του
παιχνιδιού εφόσον συντρέχει σοβαρός λόγος διακοπής.
<p></p>
Φυσικά, μπορούμε να αποχωρήσουμε από το τραπέζι μόλις νιώσουμε ότι η παρτίδα έχει τελειώσει, δηλαδή
όταν το υπόλοιπο της κάσας έχει φτάσει κοντά στο μηδέν, ή έχει γίνει αρνητικό (το τρέχον υπόλοιπο
της κάσας εμφανίζεται συνεχώς στο επάνω μέρος της τσόχας, μαζί με άλλες χρήσιμες πληροφορίες).
Μπορούμε, πάντως, να συνεχίσουμε την παρτίδα για όσο χρόνο επιθυμούμε, ακόμη και με αρνητικό υπόλοιπο κάσας,
αποφεύγοντας με τον τρόπο αυτό τις περίπλοκες διαδικασίες συνεννόησης για αύξηση της κάσας κλπ. Έτσι κι αλλιώς
τα καπίκια που κερδίζουν, ή χάνουν οι παίκτες κάθε στιγμή, εμφανίζονται συνεχώς στο τραπέζι,
πράγμα που καθιστά άχρηστες οποιεσδήποτε περίπλοκες διαδικασίες τελειώματος της παρτίδας.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/matakias.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Το ανθρωπάκι με τα γυαλιά είναι ένα πολύ χρήσιμο εικονίδιο με το οποίο μπορούμε να αλλάζουμε τον
τρόπο με τον οποίο συμμετέχουμε σε κάποιο τραπέζι.
Πράγματι, κάνοντας κλικ σ' αυτό το εικονίδιο μπορούμε από παίκτες να γίνουμε θεατές στο τραπέζι
και το αντίστροφο.
Βεβαίως, για τη μεταλλαγή μας από θεατές σε παίκτες του τραπεζιού θα πρέπει να υπάρχει κενή θέση
στο τραπέζι και να έχουμε πρόσκληση για το τραπέζι αυτό.
<p></p>
Για να εισέλθουμε απευθείας ως θεατές σε κάποιο τραπέζι ο ασφαλέστερος τρόπος είναι να κάνουμε
κλικ στον κωδικό αριθμό του τραπεζιού από το χώρο του καφενείου.
Μπορούμε, ακόμη, να αποδεχθούμε τυχόν πρόσκληση που μας έκαναν οι παίκτες του τραπεζιού, αλλά
σ' αυτήν την περίπτωση, εφόσον υπάρχει κενή θέση θα εισέλθουμε ως παίκτες και κατόπιν θα πρέπει
να αλλάξουμε τη συμμετοχή μας ως θεατές.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/emoticonOn.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ στο εικονίδιο των smilies εμφανίζεται πάνελ με smilies δεξιά από το χώρο συζήτησης.
Εκεί ο παίκτης μπορεί να επιλέξει από διάφορες σειρές smilies κάνοντας κλικ στο σχετικό εικονίδιο εναλλαγής
<span class="nobr">(<img src="../ikona/panel/4Balls.png" class="odigiesIconInline" />).</span>
Ο χρήστης μπορεί να κλείσει το πάνελ των smilies κάνοντας κλικ στο σχετικό εικονίδιο
<span class="nobr">απόκρυψης (<img src="../ikona/panel/emoticonOff.png" class="odigiesIconInline" />)</span>
του control panel.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/funchat/on.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ στο εικονίδιο των διασκεδαστικών μηνυμάτων εμφανίζεται πάνελ διασκεδαστικών εικόνων
και μηνυμάτων που μπορείτε να στέλνετε ως σχόλια στους συμπαίκτες σας.
Για να στείλετε ένα διασκεδαστικό μήνυμα, απλώς κάντε κλικ στην αντίστοιχη εικόνα και, αφού αλλάξετε
το συνοδευτικό μήνυμα (εφόσον, βέβαια, επιθυμείτε να αλλάξετε το μήνυμα αυτό), επικυρώστε την κίνησή
σας και η εικόνα μαζί με το μήνυμα που επιλέξατε θα εμφανιστούν στο χώρο της ανταλλαγής μηνυμάτων
του τραπεζιού.
Ο χρήστης μπορεί να κλείσει το πάνελ των διασκεδαστικών μηνυμάτων κάνοντας κλικ στο σχετικό εικονίδιο
<span class="nobr">απόκρυψης (<img src="../ikona/panel/funchat/off.png" class="odigiesIconInline" />)</span>
του control panel.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/kafedaki.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας κλικ στο συγκεκριμένο εικονίδιο, μπορείτε να παραγγείλετε καφεδάκι όσο περιμένετε τους
συμπαίκτες σας.
Οφείλω, πάντως, να πω ότι ο καφετζής είναι κάπως ιδιόρρυθμος…
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/paraskinio.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Κάνοντας διαδοχικά κλικ στην παλέτα παρασκηνίων αλλάζουμε το μοτίβο του παρασκηνίου.
Ο «Πρεφαδόρος» ξεκινά αρχικά με ένα διακριτικό μοτίβο παρασκηνίου, αλλά μπορείτε να επιλέξετε
κάποιο διακριτικότερο ή πιο έντονο μοτίβο παρασκηνίου.
Το μοτίβο παρασκηνίου ακολουθεί τον παίκτη και όχι τον υπολογιστή στον οποίον εκτελείται το πρόγραμμα.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/kinito.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Αν παίζετε από συσκευή κινητού τηλεφώνου, iphone, ipad κλπ, τότε είναι πιθανόν το πρόγραμμα
να σας εμφανίζει ψευδοπληκτρολόγιο μετά από κάθε σας κίνηση.
Αυτό συμβαίνει επειδή το πρόγραμμα φροντίζει να εστιάζει στο πεδίο συζήτησης μετά από κάθε σας κίνηση,
ώστε να διευκολύνει την επικοινωνία με τους συμπαίκτες σας.
Στην περίπτωση, όμως, των κινητών τηλεφώνων, ή γενικά συσκευών που εμφανίζουν ψευδοπληκτρολόγιο
οθόνης κατά την εστίαση σε πεδία γραφής μηνυμάτων, αυτό το γεγονός καθίσταται ενοχλητικό.
Κάνοντας κλικ στο συγκεκριμένο εικονίδιο ενεργοποιείτε, ή απενεργοποιείτε την αυτόματη εστίαση
στο πεδίο γραφής μηνυμάτων μετά από κάθε σας κίνηση, επομένως μπορείτε να απενεργοποιήσετε
τη συγκεκριμένη λειτουργία όταν παίζετε από κινητό τηλέφωνο ή άλλη παρόμοια συσκευή.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/entasi.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Το πρόγραμμα παράγει διάφορους ήχους και είναι πιθανόν είτε να μην τους ακούμε καλά εφόσον
βρισκόμαστε σε θορυβώδες περιβάλλον, είτε να θέλουμε να τους απενεργοποιήσουμε για να μην ενοχλούμε.
Πατώντας διαδοχικά το συγκεκριμένο εικονίδιο μπορούμε να καθορίσουμε την ένταση του ήχου
στα εξής επίπεδα: Χαμηλή, κανονική, δυνατή και σιωπηλή.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/akirosiStart.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Οποιοσδήποτε παίκτης του τραπεζιού μπορεί να ακυρώσει την τελευταία κίνηση της τρέχουσας διανομής
κάνοντας κλικ στο συγκεκριμένο εικονίδιο.
Η ενέργεια αυτή μπορεί να επαναληφθεί όσες φορές θέλουμε και μπορούμε με τον τρόπο αυτό
να επανέλθουμε σε οποιοδήποτε σημείο της διανομής.
Προσοχή όμως!
Ο μόνος τρόπος να επαναφέρουμε τις κινήσεις που έχουν ακυρωθεί είναι να επαναλάβουν οι παίκτες
τις ίδιες κινήσεις, πράγμα που πιθανότατα θα απαιτεί τη συμμετοχή και των υπολοίπων παικτών.
</td>
</tr>
</table>

<table class="odigiesPara">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/akirosiStop.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Όσο κάποιος παίκτης ακυρώνει κινήσεις, οι υπόλοιποι παίκτες δεν μπορούν να κάνουν καμία κίνηση στο
παιχνίδι, ενώ στο control panel εμφανίζεται το εικονίδιο αναμονής.
Όταν ο παίκτης που ακυρώνει κινήσεις επαναφέρει την παρτίδα στο επιθυμητό σημείο, κάνει κλικ
σ' αυτό το εικονίδιο και το παιχνίδι συνεχίζεται κανονικά.
Λήξη της διαδικασίας ακύρωσης μπορούν να κάνουν και οι υπόλοιποι παίκτες του τραπεζιού,
εφόσον ο παίκτης που ακυρώνει κινήσεις αμελεί να το κάνει.
</td>
</tr>
</table>

<table width="100%">
<tr>
<td class="odigiesIconColumn">
<img src="../ikona/panel/bugFix.png" class="odigiesIcon" />
</td>
<td class="odigiesKimeno">
Είναι πιθανόν το πρόγραμμα να παρουσιάζει προβλήματα.  Τα προβλήματα αυτά μπορεί να οφείλονται είτε σε
προγραμματιστικά λάθη, είτε σε φυσικά προβλήματα, π.χ. προβληματική σύνδεση, προβλήματα στον server κλπ.
Κάνοντας κλικ στο εικονίδιο αντιμετώπισης προβλημάτων, το πρόγραμμα επιχειρεί να ανανεώσει τη εικόνα
του τραπεζιού κάνοντας replay όλες τις κινήσεις της τελευταίας διανομής.
Αν τα προβλήματα επιμένουν, μπορείτε να κάνετε ανανέωση (επαναφόρτωση) της σελίδας με το
ειδικό κουμπί του φυλλομετρητή σας.
Τέλος, μπορείτε να ακυρώσετε τις τελευταίες κινήσεις μέχρι να επανέλθει η παρτίδα σε σημείο
στο οποίο δεν εμφανίζει προβλήματα.
Αν πάλι δεν λυθούν τα προβλήματα, μπορείτε πάντα να απευθύνετε
<a target="_blank" href="mailto:<?php print SUPPORT_EMAIL .
	'?subject=' . $_SERVER["HTTP_HOST"] . ':&#37;20problem&#37;20report' .
	'&amp;cc=' . OWNER_EMAIL; ?>">email</a>
στον κατασκευαστή του προγράμματος κάνοντας κλικ στο
<span class="nobr">φάκελο (<img src="../ikona/misc/email.png" class="odigiesIconInline" />)</span>
που εμφανίζεται κάτω δεξιά σε κάθε σελίδα.
</td>
</tr>
</table>

<?php self::titlos('Προσκλήσεις'); ?>

<div class="odigiesKimeno">
Δεξιά από το control panel εμφανίζονται τρεις περιοχές:
Στο επάνω μέρος βρίσκεται η περιοχή των προσκλήσεων.
Εκεί θα δείτε τις προσκλήσεις που πιθανόν σας έχουν απευθύνει κάποιοι από τους φίλους σας.
Κάνοντας κλικ σε κάποια από τις προσκλήσεις αυτές εντάσσεστε στο αντίστοιχο τραπέζι και μπορείτε να παίξετε.
Στην ίδια όμως περιοχή εμφανίζονται και οι προσκλήσεις που απευθύνετε εσείς προς τους φίλους σας, ώστε να
μπορείτε ανά πάσα στιγμή να ανακαλέσετε κάποια από τις προσκλήσεις που έχετε στείλει.
Για να απευθύνουμε πρόσκληση σε κάποιον φίλο για συμμετοχή στο τραπέζι μας, απλώς κάνουμε κλικ
στο όνομά του στην περιοχή των φίλων, ή όπου ο παίκτης αυτός εμφανίζεται στο καφενείο.
Το τραπέζι στο οποίο αφορά η πρόσκληση είναι το νεότερο τραπέζι στο οποίο συμμετέχουμε ως παίκτες.
</div>

<div class="odigiesKimeno">
Πάνω στις προσκλήσεις θα δείτε το εικονίδιο
<img src="../ikona/misc/Xred.png" class="odigiesIconInline" />
με το οποίο απορρίπτουμε ή ανακαλούμε την πρόσκληση.
Δεν υπάρχει τρόπος επαναφοράς των προσκλήσεων, επομένως αν απορρίψετε κάποια πρόσκληση
κατά λάθος, θα πρέπει να ζητήσετε νέα πρόσκληση μέσω προσωπικού μηνύματος.
Για να αποδεχθούμε μια πρόσκληση αρκεί να κάνουμε κλικ πάνω στην πρόσκληση,
αποφεύγοντας φυσικά το εικονίδιο διαγραφής.
</div>

<div class="odigiesKimeno">
Μια σημαντική παρατήρηση που αφορά στις προσκλήσεις αφορά στις προσκλήσεις που αποστέλλονται
αυτόματα από το πρόγραμμα στον εαυτό μας κάθε φορά που ανοίγουμε ένα νέο τραπέζι.
Αυτές οι προσκλήσεις μας χρειάζονται κάθε φορά που βγαίνουμε από το τραπέζι
και είναι ο μόνος τρόπος να ξανακαθίσουμε ως παίκτες σ'&nbsp;αυτό το τραπέζι.
Μια τελευταία παρατήρηση που αφορά στις προσκλήσεις αφορά στους «απασχολημένους»
παίκτες, δηλαδή στους παίκτες που έχουν κάνει κλικ στο εικονίδιο αλλαγής κατάστασης
<span class="nobr"><img src="../ikona/panel/apasxolimenos.png" class="odigiesIconInline" />,</span>
πράγμα που σημαίνει ακριβώς ότι ο παίκτης δεν επιθυμεί να δεχθεί προσκλήσεις.
Μπορούμε να αποστείλουμε πρόσκληση σε απασχολημένους παίκτες μόνον εφόσον
αυτοί μας έχουν δηλωμένους ως «φίλους», αλλιώς η πρόσκλησή μας απορρίπτεται
αυτόματα από το πρόγραμμα και λαμβάνουμε σχετική ειδοποίηση με την οποία
πληροφορούμαστε ότι ο παίκτης είναι απασχολημένος.
</div>

<?php self::titlos('Φίλοι και ανεπιθύμητοι'); ?>

<p class="odigiesKimeno">
	Κάτω από την περιοχή των προσκλήσεων υπάρχει
	η περιοχή διαχείρισης φίλων και αποκλεισμού
	ανεπιθύμητων προσώπων. Οι φίλοι και οι
	ανεπιθύμητοι ονομάζονται, γενικά, συσχετισμένα πρόσωπα.
	Πάνω από την περιοχή εμφάνισης των συσχετισμένων
	προσώπων υπάρχει πεδίο αναζήτησης στο οποίο
	συμπληρώνουμε μέρος του ονόματος ή του login name
	των παικτών που αναζητούμε και το πρόγραμμα τους
	εμφανίζει καθώς πληκτρολογούμε τα σχετικά στοιχεία.
	Στην περιοχή των συσχετισμένων προσώπων εμφανίζονται πρώτα οι
	φίλοι μας και τελευταίοι οι παίκτες που έχουμε αποκλείσει.
	Για να απευθύνουμε πρόσκληση σε οποιονδήποτε παίκτη
	εμφανίζεται στην περιοχή των φίλων, απλώς κάνουμε
	κλικ στο όνομα του παίκτη που επιθυμούμε να
	προσκαλέσουμε στο παιχνίδι.
	Στο αριστερό μέρος των παικτών που εμφανίζονται
	υπάρχει μια βούλα χρώματος
	<span class="nobr">μπλε (<img src="../ikona/panel/balaki/ble.png"
		class="odigiesIconInline" />),</span>
	<span class="nobr">πράσινου (<img src="../ikona/panel/balaki/prasino.png"
		class="odigiesIconInline" />),</span>
	ή <span class="nobr">πορτοκαλί (<img src="../ikona/panel/balaki/portokali.png"
		class="odigiesIconInline" />),</span>
	ανάλογα με την κατάσταση του παίκτη (offline, online διαθέσιμος,
	ή online αγκαζέ).
	Περνώντας το δείκτη του ποντικιού πάνω από αυτή τη βούλα εμφανίζονται
	τα εξής εικονίδια:
</p>

<table class="odigiesPara">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/pektis/filos.png" class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Κάνοντας κλικ σε αυτό το εικονίδιο εντάσσουμε
		τον παίκτη στη λίστα των φίλων μας. Αυτό έχει ως
		αποτέλεσμα τη γρήγορη πρόσβαση ώστε να μπορούμε
		εύκολα να απευθύνουμε πρόσκληση για παιχνίδι.
	</td>
	</tr>
</table>

<table class="odigiesPara">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/pektis/apoklismos.png" class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Κάνοντας κλικ σε αυτό το εικονίδιο χαρακτηρίζουμε
		τον συγκεκριμένο παίκτη ως ανεπιθύμητο και
		τον μπλοκάρουμε από το να μας απευθύνει προσκλήσεις.
		Αυτό μπορεί να είναι χρήσιμο κυρίως στην περίπτωση
		που ο συγκεκριμένος παίκτης μας απευθύνει συνεχείς
		προσκλήσεις, ενώ δεν επιθυμούμε να συμμετέχουμε
		σε παιχνίδι μαζί του.
	</td>
	</tr>
</table>

<table class="odigiesPara">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/misc/Xgreen.png" class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Αυτό το εικονίδιο εμφανίζεται στους φίλους μας
		και μας δίνει τη δυνατότητα να αποσυσχετιστούμε
		εντελώς από τον συγκεκριμένο παίκτη.
	</td>
	</tr>
</table>

<table class="odigiesPara">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/misc/Xred.png"
			class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Αυτό το εικονίδιο εμφανίζεται στους μπλοκαρισμένους
		παίκτες και μας δίνει τη δυνατότητα να αποσυσχετιστούμε
		εντελώς από τον συγκεκριμένο παίκτη, ακυρώνοντας
		ουσιαστικά τον αποκλεισμό.
	</td>
	</tr>
</table>

<table class="odigiesPara">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/panel/sxetikos.png" class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Αυτό το εικονίδιο εμφανίζεται δίπλα στο πεδίο
		αναζήτησης φίλων και κάνοντας κλικ εδώ "καθαρίζει"
		το πεδίο αναζήτησης και εμφανίζονται
		όλα οι σχετιζόμενοι με μας παίκτες (φίλοι και αποκλεισμένοι).
	</td>
	</tr>
</table>

<table class="odigiesPara">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/panel/balaki/ble.png" class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Όταν υπάρχει μια μπλε βούλα δεξιά από το πεδίο
		αναζήτησης παικτών και φίλων, σημαίνει ότι εμφανίζονται
		παίκτες ασχέτως της κατάστασής τους, δεν ξεδιαλέγονται,
		δηλαδή, παίκτες online, διαθέσιμοι κλπ.
		Εφόσον το πεδίο αναζήτησης παραμένει κενό,
		εμφανίζονται μόνο οι σχετιζόμενοι με μας παίκτες.
		Σχετιζόμενοι παίκτες είναι αυτοί που είτε τους
		έχουμε χαρακτηρίσει ως φίλους είτε τους έχουμε αποκλείσει.
		Κάνοντας κλικ στην μπλε βούλα, η βούλα θα πάρει
		πράσινο χρώμα και θα εμφανίζονται μόνο οι διαθέσιμοι παίκτες:
	</td>
	</tr>
</table>

<table class="odigiesPara">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/panel/balaki/prasino.png" class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Όταν η βούλα που βρίσκεται δεξιά από το πεδίο
		αναζήτησης παικτών και φίλων έχει πράσινο χρώμα,
		σημαίνει ότι εμφανίζονται μόνο οι παίκτες που είναι διαθέσιμοι,
		δηλαδή παίκτες που είναι online και δεν συμμετέχουν
		ως παίκτες σε κάποιο τραπέζι.
		Αν επιθυμούμε όλους τους online παίκτες, διαθέσιμους ή μη,
		κάνουμε κλικ στην πράσινη βούλα και αυτή θα πάρει
		χρώμα πορτοκαλί:
	</td>
	</tr>
</table>

<table width="100%">
	<tr>
	<td class="odigiesIconColumn">
		<img src="../ikona/panel/balaki/portokali.png" class="odigiesIcon" />
	</td>
	<td class="odigiesKimeno">
		Όταν η βούλα που βρίσκεται δεξιά από το πεδίο
		αναζήτησης παικτών και φίλων έχει χρώμα πορτοκαλί,
		σημαίνει ότι εμφανίζονται όλοι οι online παίκτες,
		διαθέσιμοι και μη.
		Αν κάνουμε κλικ στην πορτοκαλί βούλα, η βούλα ξαναγίνεται
		μπλε και εμφανίζονται και πάλι οι αναζητούμενοι,
		ή οι σχετιζόμενοι παίκτες, ασχέτως της κατάστασής τους.
	</td>
	</tr>
</table>

<?php self::titlos('Στήσιμο τραπεζιού'); ?>

<p class="odigiesKimeno">
	Κατά την πρώτη μας είσοδο στο διαδικτυακό καφενείο,
	όπως επίσης και μετά από κάθε αποχώρησή μας από
	κάποιο τραπέζι, εμφανίζεται στο χώρο του παιχνιδιού
	προτροπή παραγγελίας πρέφας.
	Κάνοντας κλικ σε αυτήν την προτροπή δημιουργούμε νέο
	τραπέζι και εντασσόμαστε στο παιχνίδι ως πρώτος παίκτης.
	Κατόπιν μπορούμε να καθορίσουμε το ύψος της κάσας σε 500 ή 300 καπίκια
	<span class="nobr">(<img src="../ikona/panel/kasa.png" class="odigiesIconInline" />)</span>
	και να απευθύνουμε προσκλήσεις σε φίλους για
	συμμετοχή στο παιχνίδι.
</p>

<?php self::titlos('Αποδοχή και εκκίνηση'); ?>

<p class="odigiesKimeno">
	Εφόσον οι προσκεκλημένοι μας αποδεχθούν τις προσκλήσεις
	μας, θα εμφανιστούν στο τραπέζι και μπορούν να κάνουν τις
	δικές τους επιλογές στο παιχνίδι όσον αφορά στο
	ύψος της κάσας
	<span class="nobr">(<img src="../ikona/panel/kasa.png" class="odigiesIconInline" />)</span>
	και στη διάταξη των παικτών
	<span class="nobr">(<img src="../ikona/panel/diataxi.png" class="odigiesIconInline" />).</span>
	Κάθε φορά που κάποιος παίκτης συμφωνεί με τους
	όρους του παιχνιδιού μπορεί να το δηλώσει στο
	τραπέζι κάνοντας αποδοχή όρων με κλικ
	στο σχετικό εικονίδιο
	<span class="nobr">(<img src="../ikona/panel/apodoxi.png" class="odigiesIconInline" />)</span>
	του control panel. Κατά την αποδοχή εμφανίζεται
	γύρω μας ένα πρασινωπό περίγραμμα, ενώ αν
	επιλέξουμε επαναδιαπραγμάτευση
	<span class="nobr">(<img src="../ikona/panel/ixodopa.png" class="odigiesIconInline" />)</span>
	το περίγραμμα αποκτά και πάλι κοκκινωπό χρώμα.
</p>

<p class="odigiesKimeno">
	Κάθε φορά που κάποιος από τους συμπαίκτες μας αλλάζει τους όρους
	του παιχνιδιού, η πιθανή αποδοχή των όρων του παιχνιδιού
	από την πλευρά μας ακυρώνεται και θα πρέπει να
	κάνουμε εκ νέου αποδοχή, εφόσον, φυσικά, συμφωνούμε
	με τους νέους όρους του παιχνιδιού.
	Τη στιγμή κατά την οποία και ο τρίτος παίκτης αποδεχθεί τους όρους του
	παιχνιδιού &ndash;στον οποίο, σημειωτέον, το εικονίδιο
	αποδοχής εμφανίζεται πλέον ως
	<span class="nobr"><img src="../ikona/panel/go.jpg" class="odigiesIconInline" />&ndash;</span>
	το παιχνίδι ξεκινά με τον τυχαίο
	καθορισμό του παίκτη που μοιράζει και το συνακόλουθο μοίρασμα της
	τράπουλας. Ο παίκτης που μοιράζει κάθε φορά
	σημαίνεται με μια πολύχρωμη δέσμη φύλλων
	<span class="nobr">(<img src="../ikona/endixi/dealer.png" class="odigiesIconInline" />)</span>
	στην περιοχή του, ενώ κατά τη διάρκεια των δηλώσεων
	σημαίνεται και ο παίκτης που παίζει πρώτος με ένα σομόν
	<span class="nobr">άστρο (<img src="../ikona/endixi/protos.png" class="odigiesIconInline" />).</span>
</p>

<?php self::titlos('Θεατές και ιδιωτικότητα τραπεζιών'); ?>

<p class="odigiesKimeno">
	Το πρόγραμμα δίνει τη δυνατότητα παρακολούθησης των παρτίδων
	που εξελίσσονται στο χώρο του διαδικτυακού καφενείου.
	Για να παρακολουθήσετε την παρτίδα που εξελίσσεται σε κάποιο
	τραπέζι, αρκεί να περάσετε στο χώρο του καφενείου και να κάνετε
	κλικ στον κωδικό αριθμό του τραπεζιού. Εφόσον το τραπέζι δεν είναι
	πριβέ, θα μεταφερθείτε αμέσως ως θεατής στο τραπέζι.
	Ένας άλλος τρόπος για να παρακολουθήσετε την παρτίδα που
	εξελίσσεται σε κάποιο τραπέζι, είναι να αποδεχθείτε τυχόν
	πρόσκληση που σας έχει γίνει από τους παίκτες του τραπεζιού.
	Σ' αυτήν την περίπτωση δεν ελέγχεται η ιδιωτικότητα του
	τραπεζιού, επομένως μπορείτε να παρακολουθήσετε και παρτίδες
	που εξελίσσονται σε πριβέ τραπέζια, εφόσον σας έχει γίνει
	σχετική πρόσκληση.
</p>

<p class="odigiesKimeno">
	Πριβέ είναι όσα τραπέζια έχουν συνεχές περίγραμμα, ενώ
	τα τραπέζια με διακεκομμένο περίγραμμα είναι δημόσια.
	Τα τραπέζια δημιουργούνται ως δημόσια και οι παίκτες μπορούν
	να τα κάνουν πριβέ κάνοντας κλικ στο σχετικό
	<span class="nobr">εικονίδιο (<img src="../ikona/panel/prive.png"
		class="odigiesIconInline" />)</span>
	του control panel.
	Αν επιθυμούμε να ξανακάνουμε ένα τραπέζι δημόσιο, αρκεί να κάνουμε
	κλικ στο σχετικό
	<span class="nobr">εικονίδιο (<img src="../ikona/panel/dimosio.png"
		class="odigiesIconInline" />).</span>
	Στην περίπτωση που φέρνουμε το τραπέζι σε πριβέ
	κατάσταση, όσοι θεατές δεν έχουν πρόσκληση
	απομακρύνονται αυτόματα από το τραπέζι.
</p>

<p class="odigiesKimeno">
	Όταν επιλέξετε να παρακολουθήσετε κάποια
	παρτίδα αποδεχόμενος τυχόν σχετική πρόσκληση, υπάρχει
	περίπτωση να εισέλθετε ως παίκτης στο τραπέζι, εφόσον,
	βέβαια υπάρχει κενή θέση. Σ'αυτήν την περίπτωση και εφόσον
	δεν θέλετε να συμμετάσχετε ως παίκτης, αλλά ως θεατής,
	μπορείτε απλώς να κάνετε κλικ στο εικονίδιο
	<span class="nobr">θέασης (<img src="../ikona/panel/matakias.png"
		class="odigiesIconInline" />),</span>
	οπότε καθίστασθε θεατής.
	Για να γίνετε από θεατής παίκτης μπορείτε να κάνετε κλικ στο εικονίδιο
	<span class="nobr"><img src="../ikona/panel/saikatam.png"
		class="odigiesIconInline" />,</span>
	εφόσον βέβαια υπάρχει κενή θέση στο τραπέζι και έχετε
	πρόσκληση για το συγκεκριμένο τραπέζι.
</p>

<p class="odigiesKimeno">
	Οι θεατές εμφανίζονται με διακριτικό τρόπο στο αριστερό μέρος
	της τσόχας, ώστε να γνωρίζουν οι παίκτες ποιοί και πόσοι
	παρακολουθούν την παρτίδα. Οι θεατές «βλέπουν» επίσης
	και τη συζήτηση που εξελίσσεται στο τραπέζι και μάλιστα,
	όσοι από αυτούς έχουν προσκληθεί στο τραπέζι, μπορούν
	να συμμετέχουν. Όσον αφορά στα φύλλα των παικτών, οι
	θεατές επιλέγουν κάποιον παίκτη από τη σκοπιά του
	οποίου παρακολουθούν την παρτίδα και του οποίου
	τα φύλλα μπορούν να βλέπουν, όπως ακριβώς τα βλέπει
	και ο παίκτης.
</p>

<p class="odigiesKimeno">
	Υπάρχει, όμως, περίπτωση οι παίκτες να έχουν «κλείσει»
	το τραπέζι, πράγμα που σημαίνει ότι τα φύλλα των παικτών
	δεν είναι προσβάσιμα στους θεατές. Για να κλείσουμε ένα
	τραπέζι, αρκεί να να κάνουμε κλικ στο σχετικό
	<span class="nobr">εικονίδιο (<img src="../ikona/panel/klisto.png"
		class="odigiesIconInline" />)</span>
	του control panel. Το τραπέζι «ανοίγει» με κλικ σε παρόμοιο
	<span class="nobr">εικονίδιο (<img src="../ikona/panel/anikto.png"
		class="odigiesIconInline" />)</span>
	του control panel.
	Τα κλειστά τραπέζια μαρκάρονται με σχετικό εικονίδιο
	στην επάνω δεξιά γωνία της τσόχας, ή στο κάτω αριστερό
	μέρος του τραπεζιού, εφόσον βρισκόμαστε στο καφενείο.
</p>

<p class="odigiesKimeno">
	Η επιλογή του παίκτη θέασης γίνεται
	με απλό τρόπο, κάνοντας κλικ στην αριστερή πλευρά της περιοχής του παίκτη.
	Μπορούμε ακόμη να αλλάζουμε κυκλικά παίκτη θέασης
	κάνοντας διαδοχικά κλικ στο σχετικό εικονίδιο
	του control
	<span class="nobr">panel (<img src="../ikona/panel/roloi.png"
		class="odigiesIconInline" />).</span>
</p>

<?php self::titlos('Κάσα, καπίκια και φύλλο αγώνα'); ?>

<p class="odigiesKimeno">
	Κατά την εκκίνηση μιας παρτίδας πρέφας οι παίκτες
	συμφωνούν να βάλουν ένα ποσό στο τραπέζι, το οποίο ποσό
	προσπαθούν να ανακτήσουν κατά τη διάρκεια του παιχνιδιού.
	Το αρχικό ποσό που καταθέτουν οι παίκτες ονομάζεται "κάσα"
	και αρχικά όλοι οι παίκτες καταθέτουν στην κάσα το ίδιο
	ποσό· συνήθως είναι 500 ή 300 "καπίκια" για κάθε παίκτη, ανάλογα με
	τη διάρκεια που θέλουμε να έχει η παρτίδα. Όταν δεν υπάρχει
	πολύς χρόνος προτιμούμε να βάζουμε από 300 καπίκια
	στην κάσα, ενώ αν έχουμε περισσότερο χρόνο προτιμούμε
	να βάζουμε από 500 καπίκα.
</p>

<p class="odigiesKimeno">
	Αρχικά, λοιπόν, η κάσα του παιχνιδιού περιέχει συνολικά
	3Χ500=1500 ή 3Χ300=900 καπίκια. Εφόσον μια αγορά "βγει" κατά
	τα λεγόμενα του τζογαδόρου, όλοι οι παίκτες "πληρώνονται"
	τις μπάζες τους από την κάσα. Αν π.χ. γίνει αγορά
	6 κούπες, και οι μπάζες βγουν 6 για τον τζογαδόρο,
	3 για τον πρώτο αμυνόμενο και 1 για τον δεύτερο,
	θα "σηκώσουμε" συνολικά 10Χ5=50 καπίκια από την κάσα,
	τα οποία θα κατανεμηθούν 6Χ5=30 καπίκια για τον τζογαδόρο,
	3Χ5=15 καπίκια για τον πρώτο αμυνόμενο και 1Χ5=5 καπίκια
	για τον δεύτερο αμυνόμενο. Μετά την αγορά η κάσα είναι,
	λοιπόν, μειωμένη κατά το αντίτιμο της αγοράς. Το παιχνίδι
	συνεχίζεται με τον τρόπο αυτό μέχρι να εξαντληθεί το
	ποσό της κάσας.
</p>

<p class="odigiesKimeno">
	Στην περίπτωση που η αγορά δεν βγεί κατά τα λεγόμενα
	του τζογαδόρου, τότε υπάρχει διαφοροποίηση στον τρόπο
	πληρωμής. Αν ένας, ή και οι δύο αμυνόμενοι, δεν καταφέρουν
	να κάνουν τις μπάζες που τους αναλογούν, τότε "μπαίνουν
	μέσα" και η πληρωμή των μπαζών γίνεται από τον παίκτη,
	ή τους παίκτες, που έχουν μπεί μέσα. Επομένως, στην περίπτωση
	αυτή η κάσα μένει ανέγγιχτη και ο παίκτης, ή οι παίκτες, που
	μπήκαν μέσα πληρώνουν από την τσέπη τους τις μπάζες στον
	τζογαδόρο και στον συμπαίκτη που ίσως έκανε τις μπάζες που
	του αναλογούν. Επομένως, μπορούμε να πούμε ότι κατά
	κάποιο τρόπο αυξάνει ο συνολικός τζίρος του παιχνιδιού.
</p>

<p class="odigiesKimeno">
	Στην περίπτωση που μπεί μέσα ο τζογαδόρος, τότε η ζημία
	είναι διπλή: ο τζογαδόρος υποχρεώνεται, πέρα από τις μπάζες
	που έχουν κάνει οι αντίπαλοί του, να καταβάλει στην κάσα
	και το συνολικό αντίτιμο της αγοράς. Αν π.χ. γίνει αγορά
	7 κούπες και ο τζογαδόρος κάνει 6 μπάζες, ενώ ο πρώτος
	αμυνόμενος κάνει 3 μπάζες και ο δεύτερος 1 μπάζα, τότε
	ο τζογαδόρος πληρώνει από την τσέπη του 3Χ7=21 καπίκια
	στον πρώτο αμυνόμενο, 1Χ7=7 καπίκια στον δεύτερο αμυνόμενο
	και καταθέτει 10Χ7=70 καπίκια στην κάσα. Επειδή θεωρείται
	ότι όλοι οι παίκτες έχουν τα ίδια δικαιώματα στο συνολικό
	ποσό της κάσας, δηλαδή είναι εν δυνάμει κάτοχοι του 1/3
	του ποσού της κάσας, ο τζογαδόρος μας έχασε από
	αυτή την αγορά 21+7+46.66 καπίκια, δηλαδή περίπου 75 καπίκια.
</p>

<p class="odigiesKimeno">
	Το πρόγραμμα κάνει για λογαριασμό μας όλους τους παραπάνω υπολογισμούς
	και μας ενημερώνει ανά πάσα στιγμή για δύο πράγματα: το
	συνολικό ποσό της κάσας που απομένει, και τα καπίκια που
	τη δεδομένη στιγμή κερδίζει, ή χάνει ο κάθε παίκτης.
	Το συνολικό ποσό της κάσας που απομένει εμφανίζεται στη
	γραμμή πληροφοριών του τραπεζιού, στο επάνω μέρος της
	τσόχας και μάλιστα είναι διαιρεμένο δια 10, καθώς πάντα
	οι καταθέσεις ή οι αναλήψεις από την κάσα γίνονται για
	10 μπάζες. Αν, λοιπόν, στο υπόλοιπο αναφέρεται 143, τότε
	σημαίνει ότι στην κάσα απομένουν 1430 καπίκια.
	Τα καπίκια που κερδίζει, ή χάνει ο κάθε παίκτης
	ανά πάσα στιγμή, εμφανίζονται συνεχώς
	στην περιοχή του κάθε παίκτη και πρέπει πάντα το σύνολο
	των καπικιών αυτών να είναι μηδενικό.
</p>

<p class="odigiesKimeno">
	Με τον τρόπο αυτό μπορούμε να διακόψουμε ανά πάσα στιγμή
	το παιχνίδι και να μοιράσουμε κέρδη και ζημίες.
	Παρόλα αυτά, μπορούμε, εφόσον το επιθυμούμε,
	να δούμε και το φύλλο αγώνα,
	δηλαδή το κλασικό κιτάπι της πρέφας, στο οποίο αναγράφονται
	οι δοσοληψίες μεταξύ των παικτών και οι κάσα μοιρασμένη
	σε κάθε παίκτη χωριστά. Αυτή η ευκολία παρέχεται από
	το πρόγραμμα κυρίως για συναισθηματικούς λόγους, και
	για να εμφανίσουμε το φύλλο αγώνα αρκεί να κάνουμε κλικ
	στο εικονίδιο
	<span class="nobr">(<img src="../ikona/panel/kitapi.png"
		class="odigiesIconInline" />)</span>
	στο control panel.
	Το φύλλο αγώνα εμφανίζεται σε ξεχωριστό παράθυρο του
	φυλλομετρητή μας, πράγμα που σημαίνει ότι μπορούμε να
	αυξομοιώσουμε το μέγεθός του και να το τοποθετήσουμε σε
	βολική θέση. Τα στοιχεία του φύλλου αγώνα ενημερώνονται αυτόματα
	από το πρόγραμμα μετά από κάθε δοσοληψία μεταξύ των παικτών
	και της κάσας.
</p>

<p class="odigiesKimeno">
	Εφόσον χρησιμοποιήσετε το φύλλο αγώνα, θα παρατηρήσετε μια
	μικρή διαφορά από το χειρόγραφο σύστημα όσον αφορά στον τρόπο γραφής
	της κάσας του κάθε παίκτη. Πράγματι, ενώ στο χειρόγραφο σύστημα
	ενυπάρχει το "γλείψιμο" όποτε η κάσα κάποιου παίκτη δεν επαρκεί,
	στο φύλλο αγώνα οι κάσες μπορούν συνεχίσουν να μειώνονται και
	να πάρουν ακόμη και αρνητικές τιμές. Το γεγονός αυτό μπορεί να
	σας ξενίσει αρχικά, αλλά επί της ουσίας δεν υπάρχει απολύτως καμία
	διαφορά στα ποσά των κασών και των δοσοληψιών μεταξύ των παικτών,
	ενώ το συνολικό υπόλοιπο της κάσας είναι το αλγεβρικό άθροισμα
	των τριών κασών, όπως ακριβώς συμβαίνει και με το χειρόγραφο
	σύστημα γραφής.
</p>

<?php self::titlos('Τέλος παρτίδας και πληρωμή'); ?>

<p class="odigiesKimeno">
	Μια κανονική παρτίδα πρέφας τελειώνει όταν εξαντληθεί το
	ποσό της κάσας. Μάλιστα, όταν το υπόλοιπο της κάσας δεν
	επαρκεί, οι πληρωμές της τελευταίας αγοράς γίνονται με μειωμένο
	κοστολόγιο. Ακόμη, οι παίκτες μπορούν να συμφωνήσουν σε "αναγόμωση"
	της κάσας (συνήθως βάζουν ακόμη 100 καπίκια ο καθένας) και αυτό μπορεί
	να συνεχιστεί επ' αόριστον, εφόσον, βέβαια, υπάρχει χρόνος και διάθεση.
	Η διαδικτυακή πρέφα αντιμετωπίζει όλα αυτά τα ζητήματα με κάπως
	διαφορετικό τρόπο, με στόχο την απλοποίηση των διαδικασιών και
	τη διευκόλυνση των παικτών, καθώς οι παίκτες δεν έχουν ζωντανή
	επαφή και η συνεννόηση με ανταλλαγή μηνυμάτων μπορεί να είναι
	κουραστική.
</p>

<p class="odigiesKimeno">
	Κατ' αρχάς, στη διαδικτυακή πρέφα, το πρόγραμμα ενημερώνει διαρκώς τους
	παίκτες σχετικά με το πόσα καπίκια κερδίζουν, ή χάνουν ανά πάσα στιγμή.
	Τα καπίκια που κερδίζει, ή χάνει ο κάθε ένας από τους παίκτες
	εμφανίζονται στην περιοχή του κάθε παίκτη. Τα ποσά αυτά ενημερώνονται
	μετά το τέλος κάθε διανομής, επομένως ο κάθε παίκτης είναι συνεχώς
	ενημερωμένος για την οικονομική του κατάσταση.
	Όσον αφορά στο υπόλοιπο της κάσας, αυτό δεν επιμερίζεται στον
	κάθε παίκτη ξεχωριστά, αλλά εμφανίζεται ως ενιαίο υπόλοιπο
	στο επάνω μέρος της τσόχας (διαιρεμένο δια 10, καθώς
	το υπόλοιπο της κάσας μειώνεται, ή αυξάνεται πάντα κατά
	το αντίτιμο 10 μπαζών.
</p>

<p class="odigiesKimeno">
	Καθώς το παιχνίδι εξελίσσεται και εφόσον οι αγορές που γίνονται
	είναι επιτυχημένες, το υπόλοιπο της κάσας μειώνεται σταδιακά
	και κάποια στιγμή πλησιάζει στο μηδέν. Στο σημείο αυτό οι παίκτες
	θα μπορούσαν να μπουν στη διαδικασία αναγόμωσης της κάσας,
	ή της εκτέλεσης κάποιας τελευταίας αγοράς (πιθανόν με μειωμένο
	αντίτιμο). Αντ' αυτού, η διαδικτυακή πρέφα προτείνει μια ρηξικέλευθη
	μέθοδο τελειώματος, ή συνέχισης της παρτίδας. Πράγματι,
	ακόμη και αν το υπόλοιπο της κάσας έχει μηδενιστεί, ή είναι
	αρνητικό, το πρόγραμμα συνεχίζει τις διανομές μέχρι οι παίκτες
	να αποχωρήσουν από το τραπέζι.
</p>

<p class="odigiesKimeno">
	Αν κάποιος παίκτης επιθυμεί να τελειώσει την παρτίδα, μπορεί πολύ
	απλά να αποχωρήσει
	<span class="nobr">(<img src="../ikona/panel/exodos.png"
		class="odigiesIconInline" />)</span>
	από το τραπέζι. Αν υπάρχει διάθεση εκκίνησης
	μιας νέας παρτίδας, τότε οποιοσδήποτε από τους συμπαίκτες μπορεί
	να κάνει κλικ στο εικονίδιο νέας παρτίδας
	<span class="nobr">(<img src="../ikona/panel/miaPrefa.png"
		class="odigiesIconInline" />)</span>
	και οι συμπαίκτες θα λάβουν πρόσκληση για κάποιο νέο τραπέζι.
	Αν οι συμπαίκτες έχουν χρόνο και διάθεση, μπορούν, πολύ απλά,
	να συνεχίσουν την παρτίδα, ακόμη και αν το υπόλοιπο της κάσας
	είναι αρνητικό. Τα ποσά που κερδίζουν, ή χάνουν οι παίκτες
	διαμορφώνονται ακριβώς με το ίδιο τρόπο χωρίς να είναι
	απαραίτητη η αναγόμωση της κάσας ή οποιαδήποτε άλλη ενέργεια
	από την πλευρά των παικτών.
</p>

<?php self::titlos('Ανταλλαγή μηνυμάτων'); ?>

<p class="odigiesKimeno">
	Εφόσον συμμετέχετε σε κάποιο τραπέζι, μπορείτε
	να ανταλλάσσετε γραπτά μηνύματα με τους συμπαίκτες
	σας στο τραπέζι αυτό. Οι παίκτες που δεν μετέχουν
	στο τραπέζι δεν μπορούν να δουν τα μηνύματα που
	ανταλλάσσονται μεταξύ των παικτών,
	<span class="entono">
	αλλά σε καμία περίπτωση το πρόγραμμα δεν εγγυάται
	το απόρρητο των συζητήσεων
	</span>.
	Ο χώρος της ανταλλαγής μηνυμάτων
	βρίσκεται στο κάτω μέρος του δεξιού τμήματος της οθόνης
	του φυλλομετρητή σας και περιλαμβάνει δύο τμήματα:
	το πεδίο εισαγωγής μηνυμάτων στο οποίο γράφετε τα
	μηνύματά σας, και το χώρο εμφάνισης της συνομιλίας,
	ακριβώς κάτω από το πεδίο εισαγωγής μηνυμάτων.
</p>

<p class="odigiesKimeno">
	Τα μηνύματα που εισάγετε στο πεδίο εισαγωγής
	μηνυμάτων μπορούν να περιέχουν HTML tags και
	κοινοποιούνται στο χώρο συνομιλίας είτε με το πάτημα
	του πλήκτρου [Enter], είτε με κλικ στο εικονίδιο
	κοινοποίησης μηνυμάτων
	<span class="nobr">(<img src="../ikona/panel/talk.png"
		class="odigiesIconInline" />)</span>
	που βρίσκεται δεξιά από το πεδίο εισαγωγής μηνυμάτων.
	Με το πλήκτρο [Escape] μπορείτε να καθαρίσετε
	το πεδίο εισαγωγής μηνυμάτων χωρίς να κοινοποιήσετε
	το σχετικό περιεχόμενο.
</p>

<p class="odigiesKimeno">
	Μπορείτε, ακόμη να εμφυτεύσετε emoticons
	στα μηνύματά σας επιλέγοντας smileys από τη σχετική παλέτα
	που εμφανίζεται εφόσον κάνετε κλικ
	στο εικονίδιο εμφάνισης ή απόκρυψης της παλέτας
	<span class="nobr">(<img src="../ikona/panel/emoticonOff.png"
		class="odigiesIconInline" />).</span>
	Καθώς πληκτρολογείτε το μήνυμά σας, ή εισάγετε
	emoticons, εμφανίζεται το μήνυμά σας στο κάτω μέρος
	της περιοχής ανταλλαγής μηνυμάτων, αλλά οι
	συμπαίκτες σας θα το δουν μόνον εφόσον το
	κοινοποιήσετε με το πλήκτρο [Enter],
	ή κάνοντας κλικ στο σχετικό εικονίδιο
	<span class="nobr">(<img src="../ikona/panel/talk.png"
		class="odigiesIconInline" />).</span>
</p>

<p class="odigiesKimeno">
	Οι παίκτες μπορούν, αν θέλουν, να διαγράψουν την τελευταία
	γραμμή της συζήτησης που λαμβάνει χώρα στο τραπέζι.
	Πράγματι, κάνοντας κλικ στο εικονίδιο
	<span class="nobr">(<img src="../ikona/misc/Xred.png"
		class="odigiesIconInline" />),</span>
	το πρόγραμμα διαγράφει την τελευταίο σχόλιο της συζήτησης
	του τραπεζιού. Αν κάνουμε επαναλαμβανόμενες διαγραφές,
	το πρόγραμμα πιθανόν να μας ρωτήσει αν θέλουμε να
	διαγράψουμε όλη τη συζήτηση του τραπεζιού.
</p>

<p class="odigiesKimeno">
	Τέλος, κάνοντας κλικ στο χώρο εμφάνισης των μηνυμάτων, μπορείτε να
	αποκρύψετε τα μηνύματα (boss coming). Αυτό μπορεί να φανεί χρήσιμο
	σε περιπτώσεις που κάποιος πλησιάζει και δεν θέλετε να δει τη
	συζήτηση που εξελίσσεται στο τραπέζι, ειδικά όταν υπάρχουν
	εμφυτευμένες άσεμνες εικόνες ή άλλα πράγματα που δεν θέλετε
	να βρίσκονται σε δημόσια θέα. Για να επανεμφανίσετε τα
	μηνύματα, απλώς ξανακάνετε κλικ στο χώρο εμφάνισης των
	μηνυμάτων. Απόκρυψη ή επανεμφάνιση των μηνυμάτων μπορείτε
	να κάνετε και με το πλήκτρο [F12] στο πεδίο γραφής μηνυμάτων.
</p>

<p class="odigiesIpotitlos">
	Προσωπικά μηνύματα
</p>

<p class="odigiesKimeno">
	Πέρα από την ανταλλαγή μηνυμάτων εν είδει συζήτησης,
	το πρόγραμμα παρέχει και τη δυνατότητα ανταλλαγής προσωπικών
	μηνυμάτων μεταξύ των παικτών. Μπορούν, δηλαδή, οι παίκτες
	να ανταλλάσσουν μηνύματα, ακόμη και offline, μέσω ενός
	υποτυπώδους συστήματος εσωτερικού ηλεκτρονικού ταχυδρομείου.
</p>

<p class="odigiesKimeno">
	Για να αποστείλουμε προσωπικό μήνυμα σε κάποιον παίκτη
	μπορούμε να κάνουμε κλικ σε οποιονδήποτε παίκτη
	εμφανίζεται στο χώρο του καφενείου. Κάνοντας κλικ σε κάποιον
	παίκτη όπως αυτός εμφανίζεται στο καφενείο, εμφανίζεται
	επίσης η φόρμα σύνταξης και αποστολής προσωπικών μηνυμάτων.
</p>

<p class="odigiesKimeno">
	Τέλος, μπορούμε να κάνουμε κλικ στο tab [PM] του toolbar
	στο επάνω μέρος της οθόνης του φυλλομετρητή μας και
	να μεταφερθούμε στη φόρμα διαχείρισης προσωπικών μηνυμάτων,
	όπου μπορούμε τόσο να συντάξουμε και να αποστείλουμε
	προσωπικό μήνυμα σε οποιονδήποτε παίκτη, όσο και
	να διαχειριστούμε τα εισερχόμενα και τα εξερχόμενα
</p>

<p class="odigiesKimeno">
	Στη φόρμα διαχείρισης προσωπικών μηνυμάτων μπορούμε να
	διαχειριστούμε τόσο τα εισερχόμενα, όσο και τα εξερχόμενα
	μηνύματα που μας αφορούν.
	By default, στη φόρμα διαχείρισης μηνυμάτων εμφανίζονται
	τα εισερχόμενα μηνύματα που μας αφορούν, αλλά κάνοντας
	κλικ στο κουτάκι "Εξερχόμενα" μπορούμε να δούμε και τα
	μηνύματα που έχουμε αποστείλει σε παίκτες της ΔΠ.
	Κάνοντας κλικ στο όνομα του αποστολέα, μπορούμε
	να συντάξουμε απαντητικό μήνυμα, ενώ μπορούμε να
	μαρκάρουμε τα μηνύματά μας ως διαβασμένα κάνοντας κλικ
	στο <span class="nobr">εικονίδιο
	<img src="../ikona/minima/diavasmeno.png" class="odigiesIconInline" /></span>
	που εμφανίζεται δεξιά.
</p>

<p class="odigiesKimeno">
	Τέλος, μπορούμε να διαγράψουμε τόσο τα εισερχόμενα,
	όσο και τα εξερχόμενα μηνύματά μας κάνοντας κλικ
	στο σχετικό <span class="nobr">εικονίδιο
	(<img src="../ikona/minima/diagrafi.png" class="odigiesIconInline" />).</span>
	Προσοχή: διαγράφοντας ένα εξερχόμενο μήνυμα, το μήνυμα αυτό
	θα εξαφανιστεί και από το εισερχόμενα του παραλήπτη, επομένως
	αν ο παραλήπτης δεν έχει διαβάσει το μήνυμα, δεν θα το διαβάσει
	ποτέ. Είναι, λοιπόν, καλή τακτική να μην διαγράφουμε τα εξερχόμενα
	μηνύματά μας, παρά μόνο στην περίπτωση που έχουμε κάνει κάποιο
	λάθος, ή απλώς κρίνουμε ότι το μήνυμά μας δεν έχει πλέον νόημα
	να διαβαστεί από τον παραλήπτη.
</p>

<?php self::titlos('Δεοντολογία και συμπεριφορά'); ?>

<p class="odigiesKimeno">
	Αν θέλετε να καλέσετε κάποιον παίκτη στο τραπέζι
	σας, μπορείτε να του απευθύνετε πρόσκληση κάνοντας
	κλικ στο όνομά του στην περιοχή αναζήτησης παικτών.
	Υπάρχει περίπτωση η πρόσκλησή σας να μην γίνει
	δεκτή εφόσον ο παίκτης δηλώνει απασχολημένος.
	Σ' αυτήν την περίπτωση μπορείτε να δοκιμάσετε πάλι αργότερα.
	Αν η πρόσκλησή σας φτάσει στον αποδέκτη, θα εμφανιστεί
	σχετική ένδειξη στο χώρο των προσκλήσεων.
	Αν κάποια στιγμή η ένδειξη αυτή εξαφανιστεί, αυτό
	σημαίνει ότι ο παίκτης απέρριψε την προσκλησή σας,
	είτε επειδή παίζει σε κάποιο άλλο τραπέζι,
	είτε για οποιονδήποτε άλλο λόγο,
	επομένως δεν είναι καλό να τον ξανακαλέσετε
	πριν περάσει εύλογο χρονικό διάστημα.
</p>

<p class="odigiesKimeno">
	Αν είστε περιφερόμενος στο χώρο του καφενείου
	(δεν συμμετέχετε δηλαδή σε κάποιο τραπέζι είτε ως παίκτης,
	είτε ως θεατής), μπορείτε να απευθύνετε γρήγορο
	προσωπικό μήνυμα σε κάποιον παίκτη κάνοντας απλώς κλικ
	στο όνομά του όπου αυτός εμφανίζεται στο χώρο του καφενείου.
	Αν λάβετε μήνυμα με το οποίο ο παίκτης δηλώνει
	απασχολημένος, σημαίνει ότι ο παίκτης
	δεν μπορεί επί του παρόντος να σας μιλήσει,
	επομένως μπορείτε να δοκιμάσετε πάλι αργότερα.
	Αν δείτε ότι ο παίκτης δεν απαντά, αυτό σημαίνει
	ότι ο παίκτης δεν μπορεί να σας απαντήσει τη στιγμή αυτή,
	επομένως δεν έχει νόημα να τον ξαναενοχλήσετε πριν
	περάσει εύλογο χρονικό διάστημα.
</p>

<?php self::titlos('Συμβάσεις'); ?>

<p class="odigiesKimeno">
	Το παιχνίδι της πρέφας είναι ελεύθερο όσον αφορά στις δηλώσεις
	αγοράς, στις δηλώσεις συμμετοχής και στον τρόπο εκτέλεσης
	της αγοράς, τόσο για τον τζογαδόρο όσο και για για τους
	αμυνόμενους παίκτες. Ωστόσο, υπάρχουν κάποιες συμβάσεις
	που τηρούνται από τους περισσότερους παίκτες
	και αφορούν τόσο στην αγορά, όσο και στην εκτέλεση του
	παιχνιδιού. Οι συμβάσεις αυτές αποτελούν απλές λογικές επαγωγές
	των δηλώσεων και των κινήσεων των παικτών και κατά
	συνέπεια ευνοούν τους τεχνικά καταρτισμένους παίκτες
	μειώνοντας κατά το δυνατόν τον παράγοντα τύχη.
	Εξάλλου, πρόκειται για καθαρά τεχνικό παιχνίδι
	στο οποίο η τύχη πρέπει να υπεισέρχεται μόνο στη διανομή και
	όχι στην εκτέλεση του παιχνιδιού· αν κανείς ενδιαφέρεται
	για τυχερά παιχνίδια με χαρτιά, υπάρχουν πολλά και καλά
	τέτοια παιχνίδια και, πάντως, σίγουρα η πρέφα δεν είναι
	η καλύτερη επιλογή.
</p>

<p class="odigiesIpotitlos">
	Αγορά
</p>

<p class="odigiesKimeno">
	Οι συμβάσεις της πρέφας αφορούν στις τρεις βασικές
	φάσεις του παιχνιδιού: αγορά, συμμετοχή και εκτέλεση. Οι συμβάσεις
	που αφορούν στην αγορά περιορίζουν τους παίκτες όσον
	αφορά στις δηλώσεις που κάνουν κατά τη διάρκεια της
	αγοράς. Πράγματι, όταν κάποιος παίκτης μετέχει στην αγορά,
	πιθανόν να αποκλειστεί από παίκτη που προσφέρει
	ανώτερη αγορά. Η βασική σύμβαση αγοράς ορίζει ότι
	για να σταματήσει κάποιος σε κάποια αγορά πρέπει
	να έχει στο χρώμα αυτό τουλάχιστον 4 φύλλα.
	Μπορούμε, όμως, να σταματήσουμε και σε
	χρώμα με 3 μόνο φύλλα, αλλά με άσο ρήγα επικεφαλής
	και καλό φύλλο στα υπόλοιπα χρώματα.
	Αν π.χ. ένας παίκτης έχει τρίφυλλη ντάμα στις κούπες
	δεν μπορεί να σταματήσει στις κούπες, ενώ ένας παίκτης
	με άσο, ρήγα και βαλέ καρό μπορεί να σταματήσει στα καρά.
	Καλό είναι, πάντως, να αποφεύγουμε να σταματάμε σε χρώμα
	με λιγότερα από 4 φύλλα.
</p>

<p class="odigiesKimeno">
	Αν κάποιος παίκτης σταματήσει στα άχροα και παίζει πρώτος,
	τότε πρέπει να υποθέσουμε ότι κρατάει ικανό αριθμό
	τραβηχτών μπαζών. Αν, π.χ. κάποιος παίκτης έχει σταματήσει
	στα 6 άχροα, μπορούμε να υποθέσουμε ότι έχει 5+ τραβηχτές μπάζες,
	αν έχει σταματήσει στα 7 άχροα, υποθέτουμε ότι 6+ τραβηχτές μπάζες κοκ.
	Αν, όμως, ο παίκτης που έχει σταματήσει στα άχροα
	δεν παίζει πρώτος, τότε πρέπει οπωσδήποτε να κρατάει 3 άσους.
</p>

<p class="odigiesKimeno">
	Στο σημείο αυτό να σημειώσουμε ότι αν κάποιος παίκτης
	έχει δυο αγορές θα πρέπει να αποφασίσει εκ των προτέρων
	σε ποια από τις δύο αγορές θα σταματήσει· είναι αντιδεοντολογικό
	να κάνει παύσεις για να σκεφτεί και στις δύο αγορές
	δείχνοντας έτσι και τους δύο «τζόγους» που κρατά,
	όπως πολύ σωστά αναφέρει ο Λειβαδίτης στο αλφαβητάρι
	της πρέφας (εκδόσεις ΔΙΑΥΛΟΣ). Επίσης, για να σταματήσει
	κανείς σε κάποια αγορά, είναι καλό να έχει τις αντίστοιχες
	μπάζες πλην μιάς το πολύ. Αν π.χ. κάποιος παίκτης
	σταματήσει στις 7 κούπες, πρέπει να «μετράει» 6+ μπάζες
	με ατού τις κούπες. Ο κανόνας αυτός «χαλαρώνει» για τα
	6 μπαστούνια και τα 6 σπαθιά, καθώς αυτές οι αγορές
	είναι φτηνές και μπορεί ο παίκτης να σταματήσει
	σ'αυτές τις αγορές ακόμη και με 4.5 μπάζες.
</p>

<p class="odigiesKimeno">
	Αν κάποιος παίκτης έχει μικρή αγορά (έξι μπάζεις) σε ακριβό χρώμα
	(καρά ή κούπες), τότε μπορεί να δηλώσει «άμα μείνουν»,
	αλλά δεν μπορεί να σταματήσει σ'αυτά τα χρώματα με λιγότερες
	από 5 μπάζες. Ένας παίκτης μπορεί να πει «άμα μείνουν» και
	όταν κρατά τρεις άσους, ακόμη και αν δεν τηρεί προϋποθέσεις
	αγοράς σε κάποιο συγκεκριμένο χρώμα. Επομένως,
	η δήλωση «άμα μείνουν» σημαίνει συνήθως ή μικρή αγορά
	σε καρά ή κούπες, ή τρεις άσους. Αν έχουμε
	μικρή αγορά στα μπαστούνια ή στα σπαθιά και
	θέλουμε να συμμετάσχουμε στην αγορά, δεν λέμε «άμα μείνουν»,
	αλλά δηλώνουμε κανονικά την αγορά μας ακόμη
	και αν οι μπάζες που μετράμε δεν είναι 5, αλλά
	οπωσδήποτε πρέπει να είναι πάνω από 4.
	Μπορούμε, πάντως να δηλώσουμε «άμα μείνουν» και σε εξαιρετικές
	περιπτώσεις όπου κρατάμε πολύ γερό φύλλο, αλλά δεν πληρούμε
	καμιά από τις παραπάνω προϋποθέσεις.
</p>

<p class="odigiesIpotitlos">
	Συμμετοχή
</p>

<p class="odigiesKimeno">
	Όσον αφορά στις συμβάσεις συμμετοχής, ισχύει
	ότι λέμε «παίζω» σε αγορά στην οποία μας
	αναλογούν 2 μπάζες μόνον εφόσον «κόβουμε»
	από δύο μεριές (δύο χρώματα) από 2 μπάζες,
	ή σε τρεις μεριές από 1 μπάζα. Για να πάρουμε
	κάποιον «μαζί» πρέπει να έχουμε παράξενα ατού,
	π.χ. 2 μπάζες από ατού, ή «ξερό» ατού και γενικά
	καλό φύλλο, ή τρία και περισσότερα ατού γενικά. Είναι δύσκολο
	να πάρουμε κάποιον μαζί όταν κρατάμε ακριβώς δύο ατού,
	εκτός και αν ο συμπαίκτης μας έχει αγοράσει
	και έχουμε σημαντικές ελλείψεις στο χρώμα της αγοράς του.
	Πάντως, οι συμβάσεις συμμετοχής είναι σχετικά
	ελεύθερες και οι δηλώσεις συμμετοχής εξαρτώνται
	περισσότερο από την κρίση του παίκτη, παρά
	από τα λεχθέντα κατά τη φάση της αγοράς.
</p>

<p class="odigiesIpotitlos">
	Εκτέλεση
</p>

<p class="odigiesKimeno">
	Όσον αφορά στην εκτέλεση, η τήρηση των συμβάσεων
	αποσκοπεί κυρίως στην μη προαγωγή φύλλων του τζογαδόρου,
	δηλαδή φροντίζουμε να μην δώσουμε μπάζες στον
	τζογαδόρο εκεί που δεν τις έχει. Αν, π.χ. ο τζογαδόρος
	κρατά σε κάποιο χρώμα 2φυλλο ρήγα, πρέπει να φροντίσουμε
	ώστε να μην παίξουμε τον άσο μας και του κάνουμε το ρήγα μπάζα.
	Οι αμφίβολες μπάζες του τζογαδόρου λέγονται «μάτια»
	στην αργκό της πρέφας και αν κάποιος αμυνόμενος
	με το παίξιμό του προαγάγει φύλλο του τζογαδόρου,
	λέμε ότι «έβγαλε μάτι» ή «βγήκε το μάτι» κλπ.
	Γενικά ισχύει ο κανόνας: τζογαδόρος στην άκρη
	δύναμη κάτω, τζογαδόρος στη μέση αδυναμία.
</p>

<p class="odigiesKimeno">
	Τι σημαίνουν όμως αυτά; Αν ο τζογαδόρος βρίσκεται
	στα αριστερά μας, τότε τον έχουμε στην άκρη. Αυτό
	σημαίνει ότι θα παίξουμε, μετά θα παίξει ο συμπαίκτης μας
	και τελευταίος θα παίξει ο τζογαδόρος. Πρόκειται για
	δύσκολη θέση, καθώς από τη θέση αυτή βγαίνουν τα περισσότερα
	μάτια. Αν π.χ. επιλέξουμε να παίξουμε τον άσο σε χρώμα
	που μας λείπει ο ρήγας, είναι πολύ πιθανό να προαγάγουμε
	το ρήγα του τζογαδόρου. Αν, π.χ. ο τζογαδόρος κρατάει
	ρήγα και 10 μπαστούνι και τραβήξουμε τον άσο μπαστούνι, τότε
	ο τζογαδόρος θα δώσει, προφανώς, το 10 και θα εξασφαλίσει
	μπάζα με τον ρήγα.
</p>

<p class="odigiesKimeno">
	Όταν έχουμε, λοιπόν, τον τζογαδόρο στην άκρη, παίζουμε
	σε χρώμα στο οποία κρατάμε δυνατά και «δεμένα» φύλλα,
	π.χ. άσο, ρήγα, ντάμα, ή ρήγα, ντάμα, βαλέ (εξηντάρι),
	ή ακόμη ρήγα και ντάμα (σαραντάρι).
	Γενικά οι καλύτερες έξοδοι από αυτή τη θέση
	είναι τα χρώματα στα οποία έχουμε πολλά και δυνατά
	φύλλα. Αν δεν διαθέτουμε τέτοια χρώματα με τέτοια φύλλα,
	προτιμάμε, συνήθως, τυχόν αγορά του συμπαίκτη μας,
	ή κάποιο «μακρύ» χρώμα δηλαδή χρώμα στο οποίο
	κρατάμε 4 ή 5 φύλλα.
</p>

<p class="odigiesKimeno">
	Αν δεν διαθέτουμε κανένα χρώμα με τις προϋποθέσεις
	αυτές, είναι πολύ πιθανό να μην έπρεπε καθόλου
	να συμμετάσχουμε στο παιχνίδι,
	αλλά, πάντως, εφόσον παίζουμε, πρέπει να
	φροντίσουμε να μην χαλάσουμε μπάζα του συμπαίκτη μας.
	Επομένως απαγορεύεται να βγούμε σε λιμό, εκτός και
	αν κρατάμε το ρήγα ή την ντάμα στο χρώμα αυτό.
	Για τον ίδιο λόγο, αν ο συμπαίκτης μας από άκρη βάλει κάτω λιμό,
	είμαστε υποχρεωμένοι να βάλουμε το μεγαλύτερο
	φύλλο που κρατάμε στο χρώμα αυτό (άσο, ρήγα, ντάμα),
	καθώς το λιμό από άκρη που βάζει ο συμπαίκτης μας
	σημαίνει δύναμη πίσω (ρήγας, ή ντάμα).
	Αν ο συμπαίκτης μας από άκρη παίξει λιμό και εμείς
	παρ' όλο που κρατάμε μεγάλο φύλλο στο χρώμα αυτό δεν το βάλουμε,
	τότε πιθανότατα θα χάσουμε δύο μπάζες εκεί που θα χάναμε μία.
</p>

<p class="odigiesKimeno">
	Αν έχουμε τον τζογαδόρο στη μέση, τότε είμαστε
	σε ευνοϊκή θέση, ακριβώς για τους ίδους λόγους
	που αναλύσαμε παραπάνω. Στην περίπτωση που έχουμε
	τον τζογαδόρο στη μέση, αποφεύγουμε να βγούμε
	στα δυνατά μας φύλλα, αλλά προτιμούμε να βγούμε
	στην «αδυναμία» μας, π.χ. 2φυλλος βαλές,
	ή τρία λιμά κλπ. Αυτό θα δυσκολέψει τον τζογαδόρο,
	καθώς παίζει πριν από τον συμπαίκτη μας ο οποίος
	«τον περιμένει» όπως λέμε στην αργκό της πρέφας.
	Αν, π.χ. ο τζογαδόρος κρατάει ρήγα βαλέ στα καρά
	και του βάλουμε κάτω λιμό έχοντάς τον στη μέση,
	ο τζογαδόρος θα χάσει και τις δύο μπάζες, καθώς
	βάζοντας το βαλέ ο συμπαίκτης θα πιάσει την μπάζα
	με την ντάμα, ενώ αν βάλει το ρήγα ο συμπαίκτης
	μας θα πιάσει με τον άσο. Αν αντίθετα είχαμε τον
	άσο και τον τραβούσαμε από την ίδια θέση, τότε
	ο ρήγας του τζογαδόρου θα έκανε μπάζα.
</p>

<p class="odigiesKimeno">
	Πάντως, ο σκοπός παραμένει να μην «βγάλουμε μάτι»
	στον τζογαδόρο, επομένως δεν απαγορεύται
	να τραβήξουμε δυνατό φύλλο έχοντας τον τζογαδόρο
	στη μέση, αρκεί τα δυντά μας φύλλα να είναι «δεμένα»,
	δηλαδή συνεχόμενα, οπότε να μην αφήνουν χώρο για ενδιάμεσο «μάτι».
	Αν, π.χ. κρατάμε σε κάποιο χρώμα
	άσο, ρήγα και ντάμα, δεν υπάρχει κανένας
	λόγος να βάλουμε κάτω φύλλο από άλλο χρώμα
	στο οποίο έχουμε αδυναμία, αλλά μπορούμε
	με ασφάλεια να βγούμε στο δυνατό μας χρώμα.
	Βεβαίως, θα πρέπει πάντα να λαμβάνουμε υπόψιν
	και τυχόν μελλοντική έξοδο του συμπαίκτη μας σε ενδεχόμενο
	«πιάσιμο» που θα κάνει αργότερα. Πρέπει, δηλαδή, να
	«ανοίξουμε» το φύλλο του συμπαίκτη μας, ώστε
	να μην αναγκαστεί αυτός να βγάλει μάτι όταν
	έρθει η σειρά του να παίξει. Γι' αυτό το λόγο,
	πολλές φορές, οι καλοί παίκτες, ακόμη και
	αν έχουν βρει στην τσάκα τον τζογαδόρο, βάζουν
	κάτω φύλλο στην αδυναμία τους όταν έχουν τον
	τζογαδόρο στη μέση, εφόσον υποψιάζονται ότι
	ο τζογαδόρος προσπαθεί να δώσει χεριά στον
	ακριανό αμυνόμενο.
</p>

<p class="odigiesIpotitlos">
	Σινιάλα
</p>

<p class="odigiesKimeno">
	Υπάρχουν και συμβάσεις που αφορούν σε «σινιάλα» που
	κάνουν οι αμυνόμενοι ώστε να αποφύγουν να «βγάλουν
	μάτι» στον τζογαδόρο, ή απλώς να μπορέσουν να «κρατηθούν»
	σωστά και να μην μπούνε μέσα. Φυσικά, δεν μιλάμε για
	«χτυπήματα», ή «λιχνίσματα» φύλλων, αυτά απαγρεύονται
	δια ροπάλου. Τα σινιάλα μεταξύ των αμυνομένων αφορούν
	κυρίως στα φύλλα που ρίχνουν και ορισμένα από αυτά
	είναι προφανή. Αν, π.χ. ο συμπαίκτης μας παίζει
	πρώτος και βάλει κάτω το ρήγα σε χρώμα εκτός ατού,
	ενώ δεν έχει παιχτεί ο άσος, είμαστε σχεδόν σίγουροι
	ότι έχει και την ντάμα. Αν ο «μεσαίος» παίζει πρώτος
	και βάλει κάτω ατού στον τζογαδόρο, σημαίνει ότι
	έχει δύναμη σε όλα τα χρώματα και περιμένει από μας
	να έχουμε ατού, ή απλώς προσπαθεί να αποδυναμώσει
	νωρίς τον τζογαδόρο από τα ατού, ώστε να πάρουμε
	ατσάκιστες όλες τις υπόλοιπες μπάζες.
</p>

<p class="odigiesKimeno">
	Πέρα, όμως, από τα προφανή σινιάλα, υπάρχουν και συμβάσεις
	που αφορούν στα φύλλα που «τρώνε» οι αμυνόμενοι, δηλαδή
	τα φύλλα που ξεσκαρτάρουν όταν δεν μπορούν να ακολουθήσουν
	το χρώμα που παίζεται και δεν έχουν ατού.
	Στο σημείο αυτό οι απόψεις διίστανται και είναι
	καλό οι παίκτες να ξεκαθαρίζουν από πριν αν θα ακολουθήσουν
	κάποιες συμβάσεις ή όχι.
	Πράγματι, οι παλιοί πρεφαδόροι είχαν ως αρχή να «τρώνε»
	πρώτα τα άχρηστα φύλλα τους, ενώ οι νεότεροι ακολουθούν
	την αρχή: το πρώτο φύλλο που ξεσκαρτάρουμε είναι από τη δύναμή μας,
	ενώ το επόμενο από την αδυναμία. Εξαίρεση σ' αυτόν τον κανόνα
	αποτελούν οι αχρωμάτιστες αγορές, όπου το πρώτο φύλλο
	που ξεσκαρτάρουμε δείχνει αδυναμία.
</p>

<p class="odigiesKimeno">
	Εγώ, προσωπικά, ακολουθώ περισσότερο την παλαιότερη σύμβαση,
	ξεσκαρτάροντας φύλλα από την αδυναμία μου, καθώς
	η αποδυνάμωση της δύναμής μας αποβαίνει, συχνά,
	καταστροφική. Αν, π.χ. κρατώ άσο, ντάμα και λιμό
	κούπα, ξεσκαρτάροντας τη λιμή μου κούπα είναι
	πολύ πιθανό να κάνει «μπάζα» ο τρίφυλλος ρήγας,
	ή βαλές κούπα που ίσως διαθέτει ο τζογαδόρος.
	Αν όμως έχω σε κάποιο χρώμα άσο, 7, 8 και 9
	είναι πιθανόν να ξεσκαρτάρω πρώτο φύλλο το
	εφτάρι, επομένως τα φύλλα που ξεσκαρτάρουμε
	θα πρέπει πάντα να αξιολογούνται στα πλαίσια
	της εκάστοτε διανομής, λαμβανομένων υπόψιν
	των δεδομένων της συγκεκριμένης αγοράς,
	δηλαδή των δηλώσεων που έχουν προηγηθεί,
	τις διαδικασίες συμμετοχής και τα φύλλα
	που έχουν ήδη παιχθεί.
</p>

<p class="odigiesKimeno">
	Η μόνη ασφαλής εκτίμηση για το φύλλο που κρατά ο συμπαίκτης μας
	είναι συμμετοχή του ή μη στο παιχνίδι.
	Ας υποθέσουμε π.χ. ότι ο τζογαδόρος έχει αγοράσει 7 σπαθιά,
	παίζει πρώτος και συμπαίκτης μας που παίζει αμέσως μετά τον
	τζογαδόρο δήλωσε "παίζω", ενώ εμείς κρατάμε ρήγα, βαλέ, λιμό
	στα ατού και βαλέ, ντάμα, ρήγα στις κούπες.
	Αυτό σημαίνει ότι ο συμπαίκτης μας πρέπει να κρατά τον άσο κούπα.
	Πράγματι, στο σενάριο όπου ο τζογαδόρος ξεκινά τραβώντας τα ατού,
	και ο συμπαίκτης μας δεν κρατά τον άσο κούπα, θα έπρεπε να μπορεί
	να απαντήσει σε 6, 7 ή 8 ατού και πιθανόν σε 4, 5 κούπες, πράγμα
	που θα έκανε απαγορευτική τη συμμετοχή του στο συγκεκριμένο παιχνίδι,
	καθώς τη στιγμή που αποφασίζει να παίξει δεν γνωρίζει ότι εμείς
	κρατάμε τρία ατού και τρεις δυνατές κούπες, επομένως θα πρέπει
	να υπολογίζει τα δικά μας φύλλα στο χέρι του τζογαδόρου.
</p>

<?php self::titlos('Τεχνικά θέματα'); ?>

<p class="odigiesKimeno">
	Στο επάνω μέρος της οθόνης του φυλλομετρητή σας
	υπάρχει γραμμή με χρήσιμα tabs (Καφενείο, Βοήθεια, Είσοδος, Έξοδος κλπ).
	Αυτή η γραμμή ονομάζεται tool bar, ενώ στο κάτω μέρος της
	οθόνης εμφανίζεται το ribbon bar που περιέχει κάποια εργαλεία
	και χρήσιμες πληροφορίες.
	Στο αριστερό μέρος του ribbon bar υπάρχει
	αναφορά στην άδεια χρήσης και διανομής του προγράμματος,
	καθώς επίσης και links προς τους κλασικούς validators
	τόσο της ίδιας της σελίδας όσο και των σχετικών φύλλων διαμόρφωσης
	της σελίδας. Αν δεν γνωρίζετε τι είναι όλα αυτά μην κάνετε
	κλικ στα αντίστοιχα εικονίδια.
</p>

<p class="odigiesKimeno">
	Στο κεντρικό μέρος του ribbon bar υπάρχει το copyright
	statement του προγράμματος και χρήσιμες πληροφορίες
	που αφορούν στα δικαιώματα και στην άδεια χρήσης διαφόρων
	στοιχείων του προγράμματος (εικονίδια κλπ).
	Τέλος, στο δεξί μέρος του ribbon bar εμφανίζεται το
	όνομα του προγραμματιστή που συντηρεί και αναπτύσσει το πρόγραμμα
	και μπορείτε να επικοινωνήσετε μαζί του μέσω email κάνοντας κλικ στο σχετικό
	<span class="nobr">εικονίδιο
	(<img src="../ikona/misc/email.png" class="odigiesIconInline" />).</span>
	Στην ίδια περιοχή εμφανίζονται, επίσης, χρήσιμες
	πληροφορίες που αφορούν στην επικοινωνία μας με τον server.
</p>

<p class="odigiesKimeno">
	Πράγματι, κατά τη διάρκεια της συμμετοχής σας σε κάποιο τραπέζι,
	ή, γενικά, της παραμονής σας στο χώρο του διαδικτυακού καφενείου της πρέφας,
	ο φυλλομετρητής σας επικοινωνεί σε τακτά χρονικά διαστήματα
	με τον server και σας ενημερώνει για τα τεκταινόμενα
	στο τραπέζι σας. Υπάρχουν και έκτακτες ενημερώσεις που
	εκτελούνται μετά από κάθε σας κίνηση, π.χ. αλλαγή κάσας.
	Κάθε φορά που ο server επιστρέφει πληροφορίες στον
	φυλλομετρητή σας, εμφανίζεται στην περιοχή ελέγχου
	επικοινωνίας μια βούλα. Οι βούλες αυτές έχουν
	πράσινο, πορτοκαλί ή ιώδες χρώμα.
	Ο συνολικός αριθμός ενημερώσεων του φυλλομετρητή σας
	εμφανίζεται δεξιά από τις βούλες με πράσινο χρώμα.
</p>

<p class="odigiesKimeno">
	Αν παρουσιαστούν κόκκινες βούλες στην περιοχή ελέγχου,
	τότε σημαίνει ότι ο φυλλομετρητής σας αντιμετωπίζει
	προβλήματα στην επικοινωνία σας με τον server. Ο συνολικός
	αριθμός των προβλημάτων επικοινωνίας εμφανίζεται στην ίδια
	περιοχή με κόκκινο χρώμα. Αν ο κύκλος της τακτικής επικοινωνίας
	σας με τον server διακοπεί για οποιοδήποτε λόγο, τότε
	ο φυλλομετρητής σας ξεκινά νέο κύκλο τακτικής επικοινωνίας.
	Ο συνολικός αριθμός επανεκκινήσεων εμφανίζεται στην ίδια
	περιοχή με γκρίζο χρώμα. Καλό είναι, πάντως, να μην έχουμε
	λάθη ή επανεκκινήσεις, διότι όλα αυτά σημαίνουν προβλήματα
	τόσο στην επικοινωνία όσο και στον ίδιο τον server (κακή
	ποιότητα γραμμών, μεγάλος φόρτος εργασίας στον server κλπ).
</p>

<p class="odigiesKimeno">
	Όσον αφορά στην επιλογή φυλλομετρητή για τον Πρεφαδόρο,
	η καλύτερη επιλογή φαίνεται να είναι ο Chrome, ενώ
	η χειρότερη είναι μάλλον ο Internet Explorer.
	Αυτό, φυσικά, δεν έχει να κάνει με την ποιότητα
	των συγκεκριμένων φυλλομετρητών (όλοι οι γνωστοί
	φυλλομετρητές είναι σπουδαία προγράμματα),
	αλλά με τον τρόπο που επικοινωνεί ο φυλλομετρητής
	με τον server του Πρεφαδόρου. Πράγματι, δεν πρόκειται
	για απλά φορτώματα κάποιων σελίδων, αλλά για
	μεγάλο αριθμό επαναλαμβανόμενων κλήσεων προς
	τον ίδιο ιστότοπο, πράγμα που μπορεί να οδηγεί
	κάποιους φυλλομετρητές σε λανθασμένα συμπεράσματα
	και συνακόλουθη απρόσμενη συμπεριφορά.
	Όσον αφορά στην ποιότητα των εικόνων, των χρωμάτων
	και των γραμματοσειρών, φαίνεται να υπερέχουν ο
	Opera και ο Safari, ενώ ο Firefox παραμένει πάντα
	μια αξιόπιστη και ασφαλής επιλογή με χιλιάδες πρόσθετα
	στο «οπλοστάσιό» του.
</p>

<?php self::titlos('Αντιμετώπιση προβλημάτων'); ?>

<p class="odigiesKimeno">
	Επειδή κανένα πρόγραμμα δεν είναι τέλειο, ούτε οι web servers
	μπορούν πάντα να ανταποκρίνονται άψογα στον κυκεώνα του διαδικτύου,
	είναι πολύ πιθανόν να αντιμετωπίσετε, ή να έχετε ήδη αντιμετωπίσει
	κάποια προβλήματα που αφορούν σε δυσλειτουργίες της διαδικτυακής πρέφας.
	Τα προβλήματα οφείλονται είτε σε προγραμματιστικές αβλεψίες,
	είτε σε αδυναμία του server να ανταποκριθεί στα καθήκοντά του.
	Ορισμένα από αυτά τα προβλήματα είναι:
</p>

<ul>
<li>
	<p class="odigiesKimeno">
		Αδικαιολόγητες καθυστερήσεις.
	</p>
</li>
<li>
	<p class="odigiesKimeno">
		Άλλος παίκτης έχει σειρά να παίξει και σε άλλον δίνονται επιλογές.
	</p>
</li>
<li>
	<p class="odigiesKimeno">
		Ενώ έχουμε κάνει τη δήλωσή μας, ή έχουμε παίξει κάποιο φύλλο,
		οι συμπαίκτες μας δεν φαίνεται να το έχουν αντιληφθεί.
	</p>
</li>
</ul>

<p class="odigiesKimeno">
	Τα παραπάνω προβλήματα, ή οποιαδήποτε άλλη παράξενη συμπεριφορά του
	προγράμματος σημαίνουν, συνήθως, κάποια δυσλειτουργία και θα πρέπει
	να προβούμε στις παρακάτω ενέργεις για τη θεραπεία των προβλημάτων αυτών.
	Συνοπτικά η διαδικασία επίλυσης των προβλημάτων έχει ως εξής:
</p>

<ul>
<li>
	<p class="odigiesKimeno">
		Κοινοποιήστε στους συμπαίκτες σας το πρόβλημα που αντιμετωπίζετε,
		π.χ. «κολλάει;», ή «ποιος παίζει;» κλπ. Αυτό βοηθάει στην αποφυγή πανικού.
	</p>
</li>
<li>
	<p class="odigiesKimeno">
		Κάντε κλικ στην <span class="nobr">πασχαλίτσα
		(<img src="../ikona/panel/bugFix.png" class="odigiesIconInline" />)</span>
		στο κάτω μέρος του control panel
		(κεντρική στήλη εργαλείων). Αν δεν αποκατασταθεί η ορθή λειτουργία,
		προχωρήστε στο επόμενο βήμα.
	</p>
</li>
<li>
	<p class="odigiesKimeno">
		Κάντε κλικ στο κουμπάκι γρήγορης ανανέωσης <span class="nobr">σελίδας
		(<img src="../ikona/panel/refresh.png" class="odigiesIconInline" />)</span>
		που βρίσκεται πάνω από την πασχαλίτσα.
		Αν και πάλι δεν λυθούν τα προβλήματα, προχωρήστε στο επόμενο βήμα.
	</p>
</li>
<li>
	<p class="odigiesKimeno">
		Κάντε ανανέωση (επαναφόρτωση) της σελίδας με το αντίστοιχο κουμπί
		του browser. Συνήθως είναι ένα στρογγυλεμένο βέλος στο επάνω μέρος
		της οθόνης του browser, αλλά οι περισσότεροι browsers κάνουν ανανέωση
		σελίδας και με το συνδυασμό Control+R.
		Αν τα προβλήματα επιμένουν, προχωρήστε στο επόμενο βήμα.
	</p>
</li>
<li>
	<p class="odigiesKimeno">
		Ακυρώστε την τελευταία κίνηση της διανομής κάνοντας κλικ στο κεραμιδί
		αριστερό <span class="nobr">βέλος 
		(<img src="../ikona/panel/akirosiStart.png" class="odigiesIconInline" />)</span>
		που βρίσκεται στο κάτω μέρος του control panel. Αν το
		πρόβλημα επιμένει, ακυρώστε μερικές ακόμη κινήσεις.
		Όσο γίνονται ακυρώσεις κινήσεων, το πρόγραμμα δεν δέχεται
		νέες κινήσεις· για να δηλώσετε ότι τελειώσατε με τις ακυρώσεις
		κάντε κλικ στο πλήκτρο τέλους <span class="nobr"> ακύρωσης
		(<img src="../ikona/panel/akirosiStop.png" class="odigiesIconInline" />).</span>
		Αν πάλι αντιμετωπίζετε προβλήματα, τότε δεν μένει παρά να βγείτε όλοι από
		το τραπέζι και να στήσετε ένα νέο τραπέζι.
	</p>
</li>
</ul>

<p class="odigiesKimeno">
	Αν, κάνοντας όλα τα παραπάνω, τα προβλήματα συνεχίζονται, τότε
	πιθανόν ο server να αντιμετωπίζει σοβαρά προβλήματα.
	Σ' αυτή την περίπτωση μπορείτε να μου στείλετε
	<a href="mailto:<?php print SUPPORT_EMAIL; ?>">mail</a>,
	ή να απευθυνθείτε στο <a target="_blank"
		href="http://prefadoros.forumgreek.com/">φόρουμ</a>
	των παικτών της διαδικτυακής πρέφας.
	Καλές σολαρίες!
</p>

<p class="odigiesKimeno" style="text-align: right;">
	[<a href="#" style="font-style: italic;">Επιστροφή στην κορυφή της σελίδας</a>]
</p>
